[
    {
        "id": "# 1. Daily Operating",
        "preprocessed_group": "# 1. Daily Operating\nWEB ACS의 Place Cycle 설정 시, AMR이 미션을 수신하고 동작하기 위해서는 Logistics 스위치와 Run 상태가 모두 ON으로 활성화되어야 한다.\n\nWEB ACS의 Place Cycle 설정 절차는 오른쪽 톱니바퀴 아이콘 클릭 후 Place Cycle 메뉴를 선택하고, 검색창에서 제어할 Place 이름을 검색하여 Logistics 스위치와 Run 상태를 각각 ON과 RUNNING으로 전환하는 순서로 진행한다.\n\nPlace Cycle의 Logistics 기능은 시스템이 미션을 생성하고 AMR이 이를 수신하여 수행하도록 활성화하는 장치이며, 생산 가동 중에는 반드시 ON, 비가동 또는 종업 시에는 OFF 상태를 유지해야 한다.\n\nPlace Cycle의 RUN 상태는 가동 중인 생산 라인에서 필수적으로 활성화해야 하는 항목이며, 대부분의 운영 상황에서 상시 ON 상태를 유지한다.\n\n생산 시작 전에는 Place Cycle의 Logistics와 Run 버튼을 ON으로 활성화하고, 생산 완료 후에는 해당 버튼들을 OFF로 변경하는 것을 운영 규칙으로 한다.\nWEB ACS의 Place Cycle 설정 메뉴에서 AUTO ON/OFF 기능을 실행하면 RUN이 활성화된 항목에 대해 Logistics를 자동으로 ON/OFF 하며, 사용자는 실제 가동 라인의 RUN 상태가 ON인지 확인하여 사용하지 않는 장소의 RUN을 OFF로 설정해야 한다.\n1. 충전기에 도킹되어 충전 중인 AMR은 충전 상태를 유지해야 하며 절대로 전원을 끄지 않는다.\n\n2. 충전기 외부에 위치하여 미션 대기 중인 AMR은 전원을 꺼야 하며, 종료 시 WEB ACS에서 해당 AMR을 선택하여 Call Cancel(미션 반환 및 대기), Job Cancel, Power OFF를 순차적으로 실행한다.\n\n3. 주말 및 공휴일 등 장기 정지 시에는 모든 AMR의 남은 임무를 완료하거나 삭제한 후, 충전기에서 200mm 이상 분리하여 전원을 끈다.\n\n4. 작업 재개를 위해 AMR을 가동하는 경우, WEB ACS에서 해당 AMR을 선택하여 Power ON을 누른 후 Call-Retry를 실행한다.\n충전기가 도킹된 상태에서 1T/0.3T AMR을 강제로 종료하여 과전류 보호용 배터리 회로 차단기가 작동했을 경우, 자동 복구 실패 시 AMR 전면 커버를 제거하고 배터리를 분리한 뒤 배터리 뒷면의 차단기 스위치를 수동으로 켜서 전원 상태를 복구한다.",
        "textbook": "# BMA 자동화 시스템 기술 백서: 운영 로직 및 전력 관리 아키텍처\n## (Technical Whitepaper: Operational Logic and Power Management Architecture in BMA Systems)\n\n**작성자:** 수석 아키텍트 (Chief Architect)\n**문서 등급:** Confidential (Internal Use Only)\n**적용 대상:** 현대자동차그룹 BMA 공정 0.3T/1T AMR 및 WEB ACS 운영 엔지니어\n\n---\n\n### 1. 서론 (Introduction)\n\n본 챕터에서는 BMA(Battery Module Assembly) 공정의 핵심 물류 자원인 AMR(Autonomous Mobile Robot)과 이를 관제하는 상위 시스템 WEB ACS(Activity Control System) 간의 **논리적 상호작용(Logical Interaction)** 및 **전력 관리 메커니즘(Power Management Mechanism)**을 다룬다.\n\n단순한 조작 절차를 넘어, 시스템이 미션(Mission)을 생성하고 할당하는 알고리즘적 배경과, 리튬이온 배터리 기반의 모빌리티 하드웨어가 전기적 안정성을 유지하기 위해 요구되는 물리적 제약 사항을 공학적 관점에서 심층 분석한다.\n\n---\n\n### 2. 미션 디스패칭 아키텍처와 Place Cycle 제어 논리\n#### (Mission Dispatching Architecture & Place Cycle Control Logic)\n\nWEB ACS는 공정 내 수백 개의 노드(Node)와 링크(Link)를 관리하며, 각 위치(Place)의 상태에 따라 AMR에게 작업을 할당한다. 이때 **'Place Cycle'** 설정은 시스템이 물리적 공간을 논리적 가용 자원으로 인식하게 만드는 핵심 인터페이스다.\n\n#### 2.1. 이중 검증 게이트웨이: Logistics와 Run 상태의 상관관계\nACS 시스템은 AMR에게 미션을 할당하기 전, **AND 논리 게이트**를 통해 해당 목적지의 유효성을 검증한다. 이 검증 과정은 `Logistics` 스위치와 `Run` 상태라는 두 가지 변수에 의해 결정된다.\n\n*   **Logistics (논리적 미션 생성 트리거):**\n    *   **기능:** 시스템 레벨에서의 '미션 생성 허가(Mission Generation Enable)' 비트(Bit)이다.\n    *   **작동 원리:** 이 스위치가 `ON` 상태일 때만 ACS의 스케줄러(Scheduler) 알고리즘이 해당 Place를 유효한 작업 대기열(Queue)에 포함시킨다. 만약 `OFF`라면, 물리적으로 설비가 가동 중이라 하더라도 ACS는 해당 위치로의 이동 명령을 생성하지 않는다. 이는 소프트웨어적인 차단막 역할을 한다.\n*   **Run (물리적 설비 가동 상태):**\n    *   **기능:** 현장 설비(Equipment)의 '물리적 준비 상태(Physical Readiness)'를 나타내는 상태 플래그이다.\n    *   **작동 원리:** `RUNNING` 상태는 해당 위치의 설비가 에러 없이 정상 작동 중이며, AMR과의 인터페이스(도킹, 이재 등)가 가능함을 의미한다.\n*   **논리적 인과관계 (Logical Causality):**\n    *   시스템은 `IF (Logistics == ON) AND (Run == RUNNING) THEN (Dispatch Mission)`의 로직을 수행한다.\n    *   따라서 운영자는 생산 시작 시 반드시 두 변수를 모두 활성화해야 하며, 비가동 시에는 이를 비활성화하여 불필요한 트래픽 생성이나 유령 미션(Ghost Mission) 할당을 방지해야 한다.\n\n#### 2.2. 배치(Batch) 제어 프로세스: Auto ON/OFF 알고리즘\n대규모 공정에서 개별 Place를 일일이 제어하는 것은 휴먼 에러(Human Error)를 유발할 수 있다. 이를 방지하기 위해 ACS는 **Auto ON/OFF** 기능을 제공한다.\n\n*   **메커니즘:** 이 기능은 `Run` 상태를 마스터 키(Master Key)로 활용한다. 사용자가 Auto 기능을 실행하면, 시스템은 현재 `Run` 상태가 `ON`인 모든 Place를 스캔(Scan)하고, 해당 항목들의 `Logistics` 스위치를 동기화(Synchronization)하여 일괄적으로 `ON`으로 전환한다.\n*   **데이터 흐름:** `User Input (Auto ON)` -> `Query (Select Places where Run=True)` -> `Update (Set Logistics=True)` -> `System Feedback (Ready to Dispatch)`.\n*   이 프로세스는 운영자가 실제 가동 라인과 시스템 설정 간의 불일치(Mismatch)를 최소화하도록 설계되었다.\n\n---\n\n### 3. AMR 전력 관리 시스템과 전기화학적 안정성\n#### (AMR Power Management System & Electrochemical Stability)\n\nAMR은 고용량 리튬이온 배터리를 동력원으로 사용하며, BMS(Battery Management System)를 통해 전압과 전류를 제어한다. 전력 관리 규정은 단순한 에너지 절약이 아닌, 배터리 셀(Cell)의 수명 보호와 시스템의 안전한 종료(Graceful Shutdown)를 위해 설계되었다.\n\n#### 3.1. 충전 중 전원 유지의 공학적 이유\n*   **규정:** 충전기에 도킹(Docking)되어 충전 중인 AMR은 절대 전원을 끄지 않는다.\n*   **Why (공학적 배경):**\n    *   **BMS 통신 유지:** 충전 중에는 AMR의 BMS와 충전기(Charger) 간에 지속적인 통신(CAN/Ethernet)이 이루어진다. 이를 통해 배터리의 전압(Voltage), 온도(Temperature), SOC(State of Charge) 정보를 실시간으로 교환하며 CC(Constant Current) 및 CV(Constant Voltage) 모드를 조절한다.\n    *   **냉각 시스템 가동:** 급속 충전 시 발생하는 열을 제어하기 위해 AMR 내부의 냉각 팬(Cooling Fan)이 가동되어야 한다. 전원을 끄면 냉각 시스템이 중단되어 배터리 셀의 열화(Degradation)를 초래할 수 있다.\n\n#### 3.2. 대기 상태(Idle)에서의 Graceful Shutdown 절차\n충전기 외부에서 대기 중인 AMR은 기생 방전(Parasitic Drain)을 막기 위해 전원을 차단해야 한다. 그러나 즉각적인 전원 차단(Hard Power Off)은 데이터 손실이나 논리적 오류를 유발하므로, 다음과 같은 **순차적 종료 시퀀스**를 준수해야 한다.\n\n1.  **Call Cancel (미션 반환):** 할당된 미션을 ACS 서버에 반환하여, 다른 로봇이 해당 작업을 수행할 수 있도록 스케줄러를 갱신한다.\n2.  **Job Cancel (작업 취소):** 로봇 내부의 로컬 컨트롤러(Local Controller)에서 수행 중인 프로세스를 중단하고, 구동 모터 및 액추에이터의 서보(Servo)를 Off 상태로 전환한다.\n3.  **Power OFF (전원 차단):** 상위 논리 회로가 안전하게 종료된 후, 물리적 전원을 차단한다.\n\n#### 3.3. 장기 보관 시 물리적 격리 (Physical Isolation)\n*   **규정:** 주말 등 장기 정지 시 충전기에서 **200mm 이상** 이격 후 전원을 끈다.\n*   **작동 원리:**\n    *   **갈바닉 절연(Galvanic Isolation) 확보:** 충전 단자와 로봇의 접촉 부위가 장기간 연결되어 있을 경우, 미세한 누설 전류(Leakage Current)가 발생하거나, 충전기 전원 차단 시 배터리에서 충전기 쪽으로 역전류(Reverse Current)가 흐를 위험이 있다.\n    *   200mm의 물리적 거리는 이러한 전기적 경로를 완벽히 차단하여 배터리의 과방전(Deep Discharge)을 방지하는 물리적 안전장치(Fail-safe)이다.\n\n---\n\n### 4. 비상 상황 복구 및 하드웨어 보호 메커니즘\n#### (Emergency Recovery & Hardware Protection Mechanism)\n\n#### 4.1. 재가동 시퀀스: Call-Retry를 통한 동기화\nAMR을 재가동할 때 `Power ON` 후 `Call-Retry`를 실행하는 것은 단순한 재시도가 아니다. 이는 **ACS 서버와 AMR 간의 상태 동기화(State Synchronization)** 과정이다.\n*   전원이 꺼져 있던 동안 ACS와 AMR 간의 정보 불일치가 발생할 수 있다. `Call-Retry` 명령은 AMR이 자신의 현재 위치(Localization)와 상태 정보를 ACS에 강제로 푸시(Push)하고, 중단되었던 미션 컨텍스트(Context)를 복원하는 핸드쉐이킹(Handshaking) 절차이다.\n\n#### 4.2. 과전류 보호 회로(OCPD) 작동 및 수동 복구\n*   **현상:** 충전 중인 1T/0.3T AMR을 강제 종료할 경우, 배터리 회로 차단기가 트립(Trip)될 수 있다.\n*   **원인 분석 (Physics):**\n    *   충전 중에는 높은 전류(High Amperage)가 흐르고 있다. 이때 강제로 시스템을 종료하면, 인덕턴스 성분에 의해 급격한 전압 스파이크(Voltage Spike)나 과도 전류(Transient Current)가 발생할 수 있다.\n    *   배터리 내부의 보호 회로(Protection Circuit)는 이를 단락(Short Circuit)이나 심각한 전기적 결함으로 인식하여, 물리적 차단기(Breaker)를 작동시켜 배터리 셀을 보호한다.\n*   **복구 메커니즘:**\n    *   이 상태는 소프트웨어 리셋으로 복구되지 않는 **하드웨어 락(Hardware Lock)** 상태이다.\n    *   따라서 엔지니어는 전면 커버를 제거하고(물리적 접근), 배터리 후면의 차단기 스위치를 직접 조작(Mechanical Reset)하여 회로를 다시 연결해야 한다. 이는 시스템 보호를 위한 최후의 보루가 정상 작동했음을 의미한다.\n\n---\n**결론:**\nBMA 공정의 안정적인 운영은 WEB ACS의 논리적 설정과 AMR 하드웨어의 물리적 특성을 정확히 이해하는 것에서 시작된다. 운영자는 각 조작 행위가 시스템의 데이터 흐름과 전기적 회로에 미치는 인과관계를 숙지하고, 정의된 프로토콜을 준수하여 시스템의 가용성(Availability)과 안전성(Safety)을 확보해야 한다."
    },
    {
        "id": "# 2. Trouble Shooting: Call Assignment",
        "preprocessed_group": "# 2. Trouble Shooting: Call Assignment\n1. ACS 상에서 Call이 생성되지 않을 경우, WEB ACS의 Place Cycle 설정 메뉴에서 해당 설비 또는 컨베이어의 Logistics와 RUN 상태가 모두 ON 및 RUNNING으로 활성화되어 있는지 확인한다.\n\n2. ACS 상에서 Call이 생성되지 않을 경우, WEB ACS의 PLC 탭에서 설비(EQP) 또는 컨베이어의 Call Type 값과 AMR의 Call Type 값이 일치하는지 대조하고, 값이 다를 경우 설비 또는 컨베이어의 Call Type을 올바른 값으로 수정한다.\n\n3. ACS 상에서 Call이 생성되지 않을 경우, 설비 HMI(EQP HMI) 화면 우측의 Call Create Pause 버튼이 활성화되어 콜 생성을 차단하고 있는지 확인한다.\n\n4. ACS 상에서 Call이 생성되지 않을 경우, WEB ACS의 Work Orders 메뉴에서 해당 AMR의 상태가 Idle인지 확인하고, 이전 작업이 남아있어 자동 복구가 실패한 경우 해당 Work Order를 삭제한다.\nAMR이 할당되지 않고 대기하는 자재 준비 지연(Warehouse Delay) 발생 시, 작업자는 WEB ACS의 Mission 탭에서 Status를 통해 작업 상태를 확인한다.\n\n자재 준비 지연(Warehouse Delay) 상황에서 창고 내 부품 준비가 늦어지는 경우(Process Delay), 작업자는 창고 내 부품 준비 지연 여부를 점검한다.\n\n자재 준비 지연(Warehouse Delay) 상황에서 창고 내 부품 준비가 실패한 경우(Preparation Fail), 작업자는 부품 재고 부족 여부 및 창고 설비의 에러 상태를 확인한다.\nMCS 상에서 LOAD 명령이 존재함에도 로봇 할당이 되지 않을 경우, WEB ACS의 Mission List를 통해 AMR에 수동 미션이 설정되어 있거나 목적지에 이미 다른 미션이 할당되어 자동 미션 수행이 불가능한 상태인지 확인해야 한다.\n\n자동 복구 실패 시, WEB ACS의 AMR Info 메뉴에서 해당 AMR이 AUTO 모드로 설정되어 있는지 확인해야 하며, AMR이 AUTO 모드일 때만 MCS 미션을 정상적으로 수행할 수 있다.\nAMR이 Way Point(WP)에서 장시간 대기하는 현상은 목적지 점유 상태 또는 창고 시스템의 로직 문제로 인해 발생한다.\n\n자동 복구 실패 시, 목적지 위치에 이미 도킹 중이거나 작업을 수행 중인 선행 AMR이 있는지 확인하여 후속 AMR의 대기 원인을 파악한다.\n\n수동 조작이 필요한 경우, 창고 시스템이 수동 모드이거나 목적지 위치 정보를 제공하지 못할 때는 창고 보전 담당자에게 연락하여 조치를 취한다.\n\nAMR이 Way Point(WP)에 도착했음에도 창고 시스템에서 적재 위치(#1 또는 #2)를 결정하여 지정해주지 않으면 AMR은 해당 위치에서 지속적으로 대기한다.\n차종 변경 시 BMA 부품, BSA용 공급, 배터리 셀 공급 프로세스의 AMR은 자재 회수가 가능하지만, Lower Case(L/C) 공급 AMR은 자재를 회수할 수 없다.\n\n차종 변경 시작 시 수동 조작이 필요한 경우, 설비 HMI에서 Call Create Pause를 'ON'으로 설정한 후 Call Cancel과 Work Reset을 순차적으로 실행한다.\n\n차종 변경 완료 후 작업을 재개하는 경우, 설비 HMI에서 Call Create Pause를 'OFF'로 설정한다.\n\n이미 로드된 자재를 작업자가 수동으로 회수하는 경우, 설비 HMI에서 Call Create Pause 'ON', Call Cancel, Work Reset을 실행한 뒤 지게차나 카트를 이용해 수동으로 언로드(Unload)하고 Call Create Pause를 'OFF'로 변경한다.\n\n이미 로드된 자재를 AMR 및 설비를 통해 자동으로 회수하는 경우, 자재를 NG 처리하여 배출 포트로 이동시킨 후 설비 HMI에서 'Call Priority' 버튼을 눌러 AMR을 호출하여 창고로 배출한다.\n작업자의 실수로 AMR의 미션이 삭제되어 적재물을 실은 상태로 정지한 경우, WEB ACS에서 해당 AMR을 수동 모드(Manual Mode)로 전환한 후 적재물 종류에 따라 다음과 같이 조치한다.\n\n1. BMA Pallet 적재 시, 자동 복구 실패 시 WEB ACS에서 MW 11, MW 21(Loaded) 또는 MW 13, MW 213(Empty) 위치를 우클릭하여 Unload를 실행한 후 자동 모드(Auto Mode)로 전환한다.\n2. BMA Parts Box 적재 시, 수동 조작이 필요한 경우 WEB ACS에서 MS25(회수 포트)를 우클릭하여 Unload 및 Unload2를 선택한 후 자동 모드(Auto Mode)로 전환한다.\n3. L/C 및 BSA 완제품 적재 시, 수동 조작이 필요한 경우 WEB ACS에서 목표 지점을 우클릭하여 Unload를 실행하고 자동 모드(Auto Mode)로 전환하거나 지게차를 이용하여 수동으로 배출한다.",
        "textbook": "# BMA 자동화 시스템 기술 백서\n## 작업 할당 로직 및 예외 상황 처리 메커니즘 (Task Allocation & Exception Handling)\n\n### 1. 개요 (Overview)\n현대자동차그룹 BMA(Battery Module Assembly) 공정의 물류 자동화는 ACS(AGV Control System)와 MCS(Material Control System), 그리고 현장의 설비 PLC(Programmable Logic Controller) 간의 정교한 데이터 핸드셰이킹(Handshaking)을 기반으로 작동한다. 본 챕터에서는 AMR(Autonomous Mobile Robot)의 작업 할당(Call Assignment) 프로세스에서 발생하는 논리적 교착 상태(Deadlock)와 통신 불일치 현상을 시스템 아키텍처 관점에서 분석하고, 이에 대한 공학적 해결 원리를 서술한다.\n\n---\n\n### 2. ACS 작업 생성 실패의 논리적 원인 분석 (Logic of Call Generation Failure)\n\nACS 상에서 작업 요청(Call)이 생성되지 않는 현상은 단순한 통신 단절이 아닌, 시스템의 **가용성 검증(Availability Check)** 및 **데이터 무결성(Data Integrity)** 검증 단계에서의 실패를 의미한다.\n\n#### 2.1. 논리적 가용성 플래그 (Logical Availability Flags)\nACS는 작업을 생성하기 전, 대상 설비(Equipment)와 컨베이어 시스템의 상태를 논리적으로 검증한다. WEB ACS의 `Place Cycle` 설정 메뉴에서 확인되는 **Logistics**와 **RUN** 상태는 시스템의 '논리적 연결됨(Logically Connected)'과 '물리적 가동 중(Physically Running)'을 나타내는 이중 안전장치다.\n*   **메커니즘:** 상위 시스템은 설비로부터 `Heartbeat` 신호를 수신하더라도, `Logistics=ON` 및 `RUN=RUNNING`이라는 두 가지 비트(Bit)가 동시에 `True`일 때만 유효한 작업 노드로 인식한다. 이 중 하나라도 비활성화될 경우, 시스템은 해당 노드를 '격리(Isolation)' 상태로 간주하여 작업 큐(Queue) 생성을 원천 차단한다.\n\n#### 2.2. 데이터 타입 불일치에 의한 프로토콜 거부 (Protocol Rejection by Type Mismatch)\n설비(EQP)와 AMR 간의 **Call Type** 불일치는 데이터베이스 레벨의 무결성 위반을 초래한다.\n*   **작동 원리:** 설비 PLC가 요청하는 자재의 속성(Call Type)과 AMR이 운송 가능한 자재의 속성(AMR Call Type)은 1:1 또는 N:1로 매핑되어야 한다. WEB ACS의 PLC 탭에서 이 값이 상이할 경우, ACS의 스케줄러(Scheduler)는 \"적합한 운송 수단 없음\"으로 판단하여 Call 생성을 중단한다. 이는 잘못된 자재가 투입되어 발생할 수 있는 물리적 공정 사고를 예방하기 위한 소프트웨어적 인터록(Interlock)이다.\n\n#### 2.3. HMI 레벨의 인터럽트 (HMI Level Interrupt)\n설비 HMI(Human-Machine Interface)의 **Call Create Pause** 버튼은 상위 시스템의 로직을 하위 레벨에서 강제로 차단하는 '소프트웨어 인터럽트' 역할을 수행한다.\n*   **인과관계:** 이 버튼이 활성화되면 PLC의 특정 레지스터 값이 변경되어, 자재가 투입 준비 완료 상태(Ready)가 되더라도 상위 ACS로 `Call Request` 트리거를 보내지 않는다. 이는 유지보수나 일시적 라인 정지 시 불필요한 트래픽 생성을 억제한다.\n\n#### 2.4. 작업 스레드 점유 (Task Thread Occupation)\nAMR이 물리적으로는 정지해 있으나 시스템상으로 작업을 할당받지 못하는 경우, **Work Orders** 메뉴의 상태 점검이 필수적이다.\n*   **Deadlock 메커니즘:** AMR의 상태가 `Idle`이 아닌 경우, 이전 작업의 트랜잭션(Transaction)이 정상적으로 종료(Commit)되지 않고 잔존해 있음을 의미한다. 데이터베이스 상에 '유령 작업(Ghost Task)'이 남아있으면, 스케줄러는 해당 AMR을 'Busy' 상태로 인식하여 신규 작업을 할당하지 않는다. 잔존 Work Order의 강제 삭제는 이러한 논리적 점유를 해제하여 리소스를 가용 상태로 복구하는 과정이다.\n\n---\n\n### 3. 자재 준비 지연 및 창고 시스템 연동 (Warehouse Integration & Latency)\n\n자재 준비 지연(Warehouse Delay)은 물리적 물류 흐름과 디지털 정보 흐름의 비동기화(Desynchronization)에서 기인한다.\n\n#### 3.1. 프로세스 지연과 준비 실패의 구분\n*   **Process Delay (준비 지연):** 창고 내부의 스태커 크레인(Stacker Crane)이나 컨베이어의 물리적 이동 시간이 예상보다 길어지는 경우다. 이는 시스템 에러가 아닌 '물리적 병목(Physical Bottleneck)' 현상이다.\n*   **Preparation Fail (준비 실패):** WMS(Warehouse Management System)가 재고 부족(Out of Stock)이나 창고 설비의 하드웨어 에러(Motor Fault, Sensor Error 등)로 인해 출고 명령을 수행할 수 없는 상태다. 이는 즉각적인 유지보수 개입이 필요한 '시스템 예외(System Exception)' 상황이다.\n\n#### 3.2. MCS 로드 명령과 자원 할당의 경합 (Resource Contention)\nMCS 상에 `LOAD` 명령이 존재함에도 로봇이 할당되지 않는 현상은 **자원 경합(Resource Contention)** 또는 **미션 중복(Mission Overlap)**에 기인한다.\n*   **분석:** WEB ACS Mission List에 수동 미션이 선점되어 있거나, 목적지 노드(Destination Node)에 다른 미션이 예약(Reservation)된 경우, 교착 상태 방지 알고리즘에 의해 자동 할당이 보류된다.\n*   **제어 모드 의존성:** AMR은 `AUTO` 모드에서만 MCS의 스케줄링 알고리즘에 반응한다. `MANUAL` 모드는 로컬 제어권이 우선시되므로 중앙 관제 시스템의 명령을 무시(Bypass)하게 설계되어 있다. 따라서 자동 복구 실패 시 AMR의 제어 모드 확인은 필수적인 디버깅 절차다.\n\n---\n\n### 4. 경로 대기 및 동적 라우팅 로직 (Way Point Waiting & Dynamic Routing)\n\nAMR이 Way Point(WP)에서 장시간 대기하는 현상은 **동적 라우팅(Dynamic Routing)** 실패 또는 **공간 상호 배제(Spatial Mutual Exclusion)** 로직의 결과다.\n\n#### 4.1. 목적지 점유와 트래픽 제어\nAMR은 충돌 방지를 위해 목적지 노드가 선행 AMR에 의해 점유(Occupied)되어 있거나, 도킹 프로세스가 진행 중일 때 WP에서 대기하도록 프로그래밍되어 있다. 이는 다중 로봇 제어 시스템(Multi-Agent System)의 기본 원칙인 상호 배제(Mutual Exclusion)가 작동하는 정상적인 대기 상태일 수 있다.\n\n#### 4.2. WMS의 위치 결정 지연 (Location Assignment Latency)\nAMR이 WP에 도착했음에도 대기하는 주된 기술적 원인은 창고 시스템(WMS)의 **적재 위치 결정 로직(Decision Logic)** 지연이다.\n*   **데이터 흐름:** AMR(WP 도착 신호) → ACS → MCS → WMS(적재 포트 #1/#2 가용성 판단) → MCS → ACS → AMR(최종 목적지 하달).\n*   **현상:** 이 데이터 체인 중 WMS가 적재 위치(#1 or #2)를 확정하여 리턴하지 않으면, AMR은 다음 이동 명령(Next Move Command)을 수신하지 못해 WP에서 무한 대기(Infinite Loop)하게 된다. 창고 시스템이 수동 모드이거나 위치 정보를 소실(Null Return)한 경우, 보전 담당자를 통한 시스템 리셋이 요구된다.\n\n---\n\n### 5. 차종 변경 시의 역물류 프로세스 (Reverse Logistics in Model Changeover)\n\n차종 변경(Model Change)은 정방향 물류(Forward Logistics)를 중단하고, 라인 내 잔류 자재를 제거하는 역물류(Reverse Logistics) 프로세스를 수반한다.\n\n#### 5.1. 자재별 회수 가능성 (Recoverability by Material Type)\n*   **회수 가능 (BMA/BSA/Battery Cell):** 표준화된 팔레트나 박스 형태의 자재는 AMR의 그리퍼나 컨베이어 인터페이스와 호환되어 자동 회수가 가능하다.\n*   **회수 불가능 (Lower Case - L/C):** L/C 공급 AMR은 공정 특성상 단방향 공급에 최적화되어 있거나, 자재의 부피 및 적재 방식의 특이성으로 인해 역방향 회수 로직이 구현되어 있지 않다. 이는 하드웨어적 제약에 따른 시스템 설계 사양이다.\n\n#### 5.2. 트랜잭션 롤백 시퀀스 (Transaction Rollback Sequence)\n차종 변경 시 수동 조작 절차는 데이터베이스의 트랜잭션을 안전하게 롤백(Rollback)하는 과정이다.\n1.  **Call Create Pause 'ON':** 신규 트랜잭션 생성 차단 (Input Blocking).\n2.  **Call Cancel:** 대기 중인 요청 큐(Queue) 삭제.\n3.  **Work Reset:** 현재 진행 중인 프로세스 강제 종료 및 초기화.\n4.  **Unload (Manual/Auto):** 물리적 자재 제거.\n5.  **Call Create Pause 'OFF':** 시스템 재가동 준비 완료 (System Resume).\n\n이 순서를 준수하지 않을 경우, 물리적 자재는 제거되었으나 시스템상에는 자재가 존재하는 **데이터 불일치(Data Inconsistency)**가 발생할 수 있다.\n\n---\n\n### 6. 미션 소실 시 수동 복구 및 예외 처리 (Manual Recovery & Exception Handling)\n\n작업자의 실수로 미션이 삭제되어 AMR이 '적재 상태(Loaded)'로 고립된 경우, 시스템은 AMR의 위치와 적재물 정보를 잃어버린 상태가 된다. 이를 복구하기 위해 가상의 시스템 상태를 강제로 주입(Injection)해야 한다.\n\n#### 6.1. 가상 노드를 통한 상태 동기화 (State Synchronization via Virtual Nodes)\nWEB ACS에서의 우클릭 및 `Unload` 명령은 실제 물리적 하역을 수행하는 것이 아니라, 시스템 상의 AMR 상태를 `Loaded`에서 `Empty`로 강제 전환하는 **논리적 리셋(Logical Reset)** 과정이다.\n\n*   **BMA Pallet:** `MW 11`, `MW 21` (적재 상태 노드) 또는 `MW 13`, `MW 213` (공차 상태 노드)와 같은 특정 메모리 워드(Memory Word) 주소에 해당하는 가상 위치를 이용하여 시스템 상태를 동기화한다.\n*   **BMA Parts Box:** `MS25`(회수 포트)와 같은 지정된 회수 노드에서 `Unload` 및 `Unload2` 명령을 수행하여, 복잡한 부품 박스의 데이터 구조를 초기화한다.\n*   **L/C 및 BSA 완제품:** 목표 지점(Destination)에서 논리적 `Unload`를 수행하거나, 지게차를 이용한 물리적 배출 후 시스템 상태를 수동으로 보정한다.\n\n이러한 수동 복구 절차 후 `Auto Mode`로의 전환은, 초기화된 상태 정보를 바탕으로 AMR이 다시 중앙 관제 시스템의 스케줄링 루프(Scheduling Loop)에 정상적으로 편입되도록 하는 최종 단계다."
    },
    {
        "id": "# 3. Trouble Shooting: Navigation & Obstacle",
        "preprocessed_group": "# 3. Trouble Shooting: Navigation & Obstacle\nACS_ERROR_WHILE_NAVIGATING_THE_ROUTE 오류는 WEB ACS 상에서 관리자가 AMR에 Move 명령을 내릴 때 목적지 지점이 정상 주행 경로가 아닌 주행 불가 영역(흰색 배경)으로 지정될 경우 발생한다.\n\n자동 복구 실패 시, WEB ACS 상단의 Job Cancel 버튼을 클릭하여 현재 작업을 취소해야 한다.\n\n수동 조작이 필요한 경우, JOG 모드를 활성화하여 AMR을 정상 주행 경로(색상이 있는 라인) 위로 이동시켜야 한다.\n\nAMR이 정상 경로 위에 위치하면, 다시 일반 경로 상의 지점을 목적지로 선택하여 Move 명령을 실행한다.\n1T AMR이 물리적으로 지정된 주행 경로를 벗어난 상태에서 주행을 시도할 경우 [80002] ERROR_NOT_ON_PATH가 발생한다.\n\n자동 복구 실패 시, WEB ACS에서 Job Cancel을 클릭하여 작업을 취소한 후 현장에서 1T AMR을 수동 또는 JOG 조작을 통해 정상 주행 경로 내부로 이동시킨다.\n\n수동 조작이 완료된 후에는 WEB ACS에서 CALL-RETRY 버튼을 클릭하거나 1T AMR의 모드를 AUTO로 전환하여 작업을 재개한다.\nAMR의 위치 신뢰도가 낮은 상태인 [80003] ERROR_CONFIDENCE_LOW 에러는 AMR이 맵에 기록되지 않은 미지의 영역으로 이동하거나, 주변의 일시적인 장애물이 고정 지형지물을 가려 라이다 센서의 위치 대조가 불가능할 때 발생한다.\n\n자동 복구 실패 시, 작업자는 AMR 주변의 시야를 가리는 장애물을 제거하고 AMR을 일반 주행 경로 내부로 이동시킨 후 제자리에서 360도 회전시켜 ACS 상의 위치와 실제 현장 위치의 일치 여부를 확인해야 한다.\n\n수동 조작이 필요한 경우, WEB ACS의 해당 AMR Command 탭에서 Init Position 항목을 선택하고 특정 노드(Location)나 맵 상의 지점(Map icon)을 지정한 뒤, 현재 AMR이 바라보는 방향(Heading) 값을 0~360도 범위 내에서 입력하고 APPLY 버튼을 눌러 위치를 강제로 보정한다.\n1T/0.3T AMR 주행 중 모터 회전수를 감지하는 엔코더 데이터가 업데이트되지 않아 [80014] ERROR_ENCODER_NOT_UPDATE 오류가 발생하며 기체가 정지하는 경우, 수동 조작이 필요한 경우 WEB ACS에서 Job Cancel을 클릭하고 AMR 기체 측면의 물리적 RESET 버튼을 누른 뒤 CALL-RETRY 또는 AUTO 모드를 실행하여 복구한다.\nAMR(Autonomous Mobile Robot)의 라이다(LIDAR) 또는 3D 카메라 센서가 주행 경로상의 장애물을 감지하면 로봇이 일시 정지하거나 에러를 발생시킨다.\nAMR 주행 경로 상에 장애물이 존재하여 라이다(LIDAR) 센서가 이를 감지하고 안전을 위해 정지한 경우, 작업자는 AMR의 정상 주행을 위해 주행 경로 상의 장애물을 제거해야 한다.\n[20014] Stop due to HOKUYO Lidar obstacle detection 발생 시, HOKUYO Lidar가 안전콘의 은색 반사판이나 작업자 안전조끼의 반사 테이프 등 빛을 강하게 반사하는 물체를 장애물로 인식하여 AMR의 속도를 감속하거나 정지시킨다.\n\n자동 복구 실패 시, AMR 주변의 장애물이나 반사경을 2m 이상 분리한 후 AMR 측면의 RESET 버튼을 누른다.\n\n수동 조작이 필요한 경우, HOKUYO Lidar 렌즈의 이물질 여부를 확인하고 전용 렌즈 클리너나 부드러운 천을 사용하여 제거한다.\n\n상기 조치 후에도 OSSD(Output Signal Switching Device)가 해제되지 않을 경우, AMR의 전원을 재부팅한다.\n\nAMR 재시작 후에도 OSSD 오류가 지속되는 경우, HYUNDAI-WIA의 S/V 담당자에게 문의하여 기술 지원을 받는다.\nAMR의 OSSD LIDAR ERROR[30020]는 기기 주변의 장애물 감지 또는 센서 오염으로 인해 안전 비상 정지 신호가 발생하여 이동이 차단된 상태를 의미하며, 자동 복구 실패 시 주변 장애물을 2m 이상 분리한 후 AMR 측면의 RESET 버튼을 누르거나 전용 클리너로 LIDAR 렌즈의 이물질을 제거해야 한다. 수동 조작 및 재시작 후에도 오류가 지속되는 경우에는 AMR의 전원을 재투입하고, 이후에도 문제가 해결되지 않으면 HYUNDAI-WIA S/V 담당자에게 문의하여 조치를 취한다.\nAMR의 Lidar에 감지된 물체가 로봇의 충돌 감지 영역(Safety Zone)과 겹쳐 PAUSED_BY_OBSTACLE 관련 알람이 발생한 경우, 작업자는 로봇 주변 및 도킹 구역 내 실제 장애물 유무를 확인하고 이를 제거해야 한다.\n\n도킹아웃 시 T-Zone 내 팔레트 등의 장애물이 감지되어 정지한 경우, 로봇 앞면과 옆면의 넓은 영역을 점검하여 장애물을 제거해야 한다.\n\n금속 설비에서 반사된 빛을 장애물로 오인하여 주행이 불가한 경우, 빛 반사가 의심되는 구역을 덮거나 비반사 필름을 부착하여 간섭을 차단해야 한다.\n\n도킹 시도 중 장애물 감지로 인해 자동 복구에 실패한 경우, 수동으로 도킹을 해제(Undocking)한 후 Web ACS에서 Call-Retry를 실행하여 재시도한다.\n[80026] PAUSE_BY_CAMERA_OBSTACLE 에러는 3D 카메라가 감지한 물체가 AMR의 충돌 감지 영역과 겹칠 때 발생하며, 주행 중에는 전면 장애물을, 도킹 중에는 도킹 위치까지의 장애물을 감지한다.\n\n해당 에러는 높이가 있는 공중의 객체도 감지하므로 바닥뿐만 아니라 상부의 장애물 유무를 함께 확인해야 한다.\n\n설비 HMI 패널 등이 AMR 도킹 위치로 돌출되어 장애물로 인식될 경우, 해당 패널의 위치를 이동시켜야 한다.\n\nAMR 주행 경로 상에 늘어진 케이블이나 호스 등의 방해물이 존재할 경우, 이를 즉시 제거해야 한다.\n\n자동 복구 실패 시, 작업자는 로봇 근처 및 도킹 구역 내부에 실제 장애물이 있는지 확인하고 이를 제거해야 한다.\n\n수동 조작이 필요한 경우, 도킹 아웃 시 로봇의 앞면과 옆면의 넓은 영역에서 감지되는 장애물을 모두 제거한 후 운행한다.",
        "textbook": "# BMA 자동화 시스템 기술 백서 (Technical Whitepaper)\n## 자율주행 내비게이션 아키텍처 및 센서 퓨전 기반 장애물 회피 메커니즘\n**(Autonomous Navigation Architecture & Sensor Fusion based Obstacle Avoidance Mechanism)**\n\n---\n\n### 1. 개요 (Overview)\n\n현대자동차그룹 BMA(Battery Module Assembly) 공정의 물류 자동화는 ACS(Agile Control System)의 글로벌 경로 계획(Global Path Planning)과 AMR(Autonomous Mobile Robot)의 로컬 제어(Local Control)가 유기적으로 결합된 복합 시스템입니다. 본 챕터에서는 0.3T 및 1T AMR이 주행 경로를 생성하고 추종하는 논리적 프로세스와, Lidar 및 3D Camera 센서 퓨전을 통해 구현되는 안전 메커니즘(Safety Mechanism)의 심층적인 작동 원리를 기술합니다. 특히 현장에서 발생하는 주요 에러 코드의 공학적 원인과 시스템의 논리적 대응 절차를 분석하여, 엔지니어가 시스템의 인과관계를 명확히 이해하도록 돕습니다.\n\n---\n\n### 2. 내비게이션 알고리즘 및 위치 추정 무결성 (Navigation Algorithm & Localization Integrity)\n\nAMR의 자율 주행은 사전에 정의된 디지털 맵(Digital Map)과 실제 환경 데이터를 실시간으로 대조하는 확률적 모델(Probabilistic Model)에 기반합니다. 이 과정에서 경로 유효성 검증 실패나 위치 추정의 불확실성이 발생할 경우, 시스템은 안전을 위해 즉각적인 예외 처리(Exception Handling) 루틴을 수행합니다.\n\n#### 2.1. 경로 계획의 유효성 검증 및 예외 처리\n**[System Logic: ACS Command Validation Layer]**\n\nACS는 AMR에게 이동 명령(Move Command)을 하달하기 전, 목적지 노드의 유효성을 검증합니다. 이때 발생하는 **`ACS_ERROR_WHILE_NAVIGATING_THE_ROUTE`**는 단순한 명령 오류가 아니라, **경로 비용 계산(Path Cost Calculation)의 실패**를 의미합니다.\n\n*   **발생 원리 (Mechanism):** ACS의 맵 데이터는 '주행 가능 영역(Costmap defined)'과 '주행 불가 영역(Undefined/White Background)'으로 이진화되어 있습니다. 관리자가 주행 불가 영역을 목적지로 지정할 경우, A* 또는 Dijkstra와 같은 경로 탐색 알고리즘은 목표 지점까지의 유효한 노드 연결(Edge Connection)을 생성할 수 없어 무한 루프나 Null 값을 반환하게 됩니다.\n*   **시스템 대응 (System Response):** 시스템은 이를 치명적 논리 오류로 간주하여 해당 Job을 거부합니다.\n*   **복구 로직 (Recovery Logic):** 자동 복구가 불가능한 논리적 교착 상태이므로, 운영자가 `Job Cancel` 신호를 통해 잘못된 명령 스택을 소거해야 합니다. 이후 JOG 모드를 통해 AMR을 Costmap이 정의된 정상 경로(Colored Line)로 물리적으로 이동시켜, 알고리즘이 다시 유효한 경로 비용을 산출할 수 있는 초기 조건을 형성해야 합니다.\n\n#### 2.2. 경로 추종 오차 및 이탈 감지 (Cross-Track Error Monitoring)\n**[Error Code: 80002 - ERROR_NOT_ON_PATH]**\n\n1T AMR은 경로 추종 시 설정된 경로와 실제 로봇 위치 간의 수직 거리 오차(Cross-Track Error, XTE)를 실시간으로 모니터링합니다.\n\n*   **발생 원리 (Mechanism):** 로봇의 제어기(Controller)는 매 제어 주기마다 `|Current_Position - Planned_Path|`를 연산합니다. 이 값이 허용 임계값(Threshold)을 초과하면, 로봇은 자신이 제어 불가능한 영역에 있다고 판단합니다. 이는 슬립(Slip) 현상이나 외력에 의한 밀림 등으로 발생할 수 있습니다.\n*   **복구 로직 (Recovery Logic):** 이탈 상태에서는 자율 복귀 경로 생성이 불가능하므로(Unsafe State), `Job Cancel` 후 수동/JOG 조작을 통해 로봇을 허용 오차 범위(정상 경로) 내로 진입시켜야 합니다. 위치가 정상 범위로 수렴하면 `CALL-RETRY` 또는 `AUTO` 모드 전환을 통해 경로 추종 PID 제어 루프를 재활성화합니다.\n\n#### 2.3. 확률적 위치 추정 및 신뢰도 저하 (Probabilistic Localization & Confidence)\n**[Error Code: 80003 - ERROR_CONFIDENCE_LOW]**\n\nAMR은 SLAM(Simultaneous Localization and Mapping) 기술, 특히 입자 필터(Particle Filter)나 그래프 기반 최적화를 통해 자신의 위치를 추정합니다.\n\n*   **발생 원리 (Mechanism):** 라이다 센서가 스캔한 현재의 점군(Point Cloud) 데이터와 저장된 맵 데이터 간의 매칭 확률(Matching Probability)이 임계치 이하로 떨어지는 현상입니다.\n    *   **환경적 요인:** 맵에 없는 미지의 영역 진입 또는 동적 장애물(지게차, 작업자 등)이 고정 지형지물(벽, 기둥)을 장시간 가려 '특징점(Feature)' 추출이 불가능한 경우 발생합니다.\n*   **복구 로직 (Recovery Logic):**\n    1.  **시야 확보:** 센서의 시야(Field of View)를 가리는 장애물을 제거하여 특징점 매칭을 유도합니다.\n    2.  **재수렴(Re-convergence):** 제자리에서 360도 회전을 수행하면 라이다가 전방위 데이터를 수집하여 위치 확률 분포를 갱신, 현재 위치를 재특정할 수 있습니다.\n    3.  **강제 초기화(Initialization):** 자동 수렴 실패 시, ACS의 `Init Position` 명령을 통해 로봇에게 현재의 절대 좌표(Node/Map Icon)와 헤딩(Heading, 0~360도) 값을 강제로 주입(Injection)하여 위치 추정 알고리즘을 리셋합니다.\n\n#### 2.4. 오도메트리 피드백 상실 (Odometry Feedback Loss)\n**[Error Code: 80014 - ERROR_ENCODER_NOT_UPDATE]**\n\n정밀 주행을 위해서는 바퀴의 회전량을 감지하는 엔코더(Encoder) 데이터가 필수적입니다.\n\n*   **발생 원리 (Mechanism):** 모터 제어기(Motor Driver)가 구동 전류를 인가했음에도 불구하고, 엔코더로부터 펄스(Pulse) 신호 변화가 감지되지 않는 상태입니다. 이는 물리적으로 바퀴가 구속(Stall)되었거나, 엔코더 통신 라인의 단선, 혹은 센서 모듈의 하드웨어적 고장을 의미합니다.\n*   **시스템 대응 (System Response):** 제어기는 이를 '제어 불능 상태'로 판단하여 즉시 모터 전원을 차단(Emergency Stop)합니다.\n*   **복구 로직 (Recovery Logic):** 이는 하드웨어 상태 불일치이므로 소프트웨어 리셋만으로는 해결되지 않을 수 있습니다. `Job Cancel` 후 기체 측면의 물리적 `RESET` 버튼을 눌러 하위 레벨 제어기(Low-level Controller)를 재부팅하고 엔코더 상태를 초기화해야 합니다.\n\n---\n\n### 3. 안전 센서 퓨전 및 OSSD 메커니즘 (Safety Sensor Fusion & OSSD Mechanism)\n\nBMA 공정의 AMR은 작업자와의 협동을 전제로 하므로, 국제 안전 규격(ISO 13849-1 등)을 준수하는 하드웨어 기반의 안전 시스템을 탑재하고 있습니다.\n\n#### 3.1. 광학적 특성에 따른 라이다 오인식 (Optical Characteristics & Lidar False Positive)\n**[Error Code: 20014 - Stop due to HOKUYO Lidar obstacle detection]**\n\nHOKUYO 안전 라이다는 ToF(Time of Flight) 방식을 사용하며, 레이저 펄스가 물체에 반사되어 돌아오는 시간을 측정합니다.\n\n*   **발생 원리 (Mechanism):**\n    *   **고반사체 간섭 (High Reflectivity):** 안전콘의 은색 반사판이나 작업자 조끼의 반사 테이프는 입사된 레이저를 광원 방향으로 강하게 반사(Retro-reflection)시킵니다. 이는 수신부 포토다이오드(Photodiode)의 포화(Saturation)를 유발하거나, '블루밍(Blooming)' 현상을 일으켜 실제보다 물체를 더 크게, 혹은 존재하지 않는 위치에 장애물이 있는 것으로 오인하게 만듭니다.\n    *   **센서 오염:** 렌즈 표면의 이물질은 레이저를 산란(Scattering)시켜 신호 대 잡음비(SNR)를 떨어뜨리고, 이를 근거리 장애물로 인식하게 합니다.\n*   **복구 로직 (Recovery Logic):**\n    *   **물리적 이격:** 고반사 물체를 2m 이상 이격시켜 수신 광량을 정상 범위로 낮춥니다.\n    *   **광학적 세척:** 전용 클리너로 렌즈를 닦아 산란 요인을 제거합니다.\n    *   **하드웨어 리셋:** 센서 내부의 에러 레지스터가 래치(Latch)된 경우, `RESET` 버튼 또는 전원 재부팅을 통해 OSSD 상태를 클리어해야 합니다. 지속적인 오류는 센서 모듈 자체의 결함일 수 있으므로 S/V 기술 지원이 필요합니다.\n\n#### 3.2. OSSD 기반 비상 정지 메커니즘 (OSSD Based Emergency Stop)\n**[Error Code: 30020 - OSSD LIDAR ERROR]**\n\nOSSD(Output Signal Switching Device)는 소프트웨어의 개입 없이 센서가 직접 전력 계통을 제어하는 최상위 안전 장치입니다.\n\n*   **작동 원리 (Mechanism):** 라이다가 설정된 안전 영역(Safety Zone) 내에서 물체를 감지하거나 자체 고장(Self-diagnosis fault)을 감지하면, OSSD 신호 라인(Dual Channel)을 Low 상태로 떨어뜨립니다. 이는 모터 구동 회로의 전원을 물리적으로 차단(Cut-off)하여 로봇을 즉시 정지시킵니다.\n*   **데이터 흐름 (Data Flow):** [Obstacle Detection] -> [Lidar Internal Logic] -> [OSSD Signal Low] -> [Safety Relay Open] -> [Motor Power Cut].\n*   **복구 로직 (Recovery Logic):** 장애물 제거 후 `RESET` 버튼을 누르는 행위는 Safety Relay에 다시 전원을 인가하여 OSSD 신호를 High 상태로 복구시키는 과정입니다.\n\n---\n\n### 4. 3D 인지 및 동적 환경 상호작용 (3D Perception & Dynamic Environment Interaction)\n\n2D 라이다의 한계(높이 정보 부재)를 극복하기 위해 3D 카메라가 퓨전(Fusion)되어 입체적인 장애물 감지를 수행합니다.\n\n#### 4.1. 3D 공간 장애물 및 충돌 방지 (Volumetric Obstacle Detection)\n**[Error Code: 80026 - PAUSE_BY_CAMERA_OBSTACLE]**\n\n*   **발생 원리 (Mechanism):** 3D 카메라는 전방 공간을 복셀(Voxel) 단위로 인식합니다. 바닥에 닿아있지 않은 공중의 물체(늘어진 케이블, 돌출된 HMI 패널 등)가 AMR의 충돌 예측 볼륨(Collision Volume) 내에 진입하면 에러를 트리거합니다.\n*   **도킹 시나리오 (Docking Scenario):** 도킹/언도킹 과정에서는 로봇과 설비 간의 간격이 매우 좁아집니다. 이때 금속 설비 표면의 정반사(Specular Reflection)가 3D 카메라에 노이즈(Ghost Object)를 생성하여 `PAUSED_BY_OBSTACLE` 알람을 유발할 수 있습니다.\n*   **복구 로직 (Recovery Logic):**\n    *   **환경 개선:** 상부 장애물(케이블 등)을 제거하거나, 금속 반사면에 비반사 필름을 부착하여 센서 간섭을 차단합니다.\n    *   **수동 탈출:** 도킹 중 장애물 감지로 교착 상태(Deadlock)에 빠진 경우, 자동 알고리즘으로는 충돌 없이 빠져나갈 경로를 계산할 수 없습니다. 따라서 작업자가 수동으로 `Undocking`을 수행하여 로봇을 안전한 공간(Free Space)으로 이동시킨 후, `Call-Retry`를 통해 작업을 재개해야 합니다.\n\n---\n\n### 5. 결론 (Conclusion)\n\nBMA 공정의 AMR 시스템 에러는 단순한 고장이 아니라, **불확실한 환경 변수로부터 시스템과 작업자를 보호하기 위한 방어 기제(Defense Mechanism)의 작동**으로 이해해야 합니다. 엔지니어는 각 에러 코드가 의미하는 센서의 물리적 한계와 알고리즘의 논리적 조건을 정확히 파악하고, 제시된 인과관계에 따라 체계적인 트러블슈팅을 수행함으로써 시스템의 가동률(Availability)을 극대화해야 합니다."
    },
    {
        "id": "# 4. Trouble Shooting: Docking & H/W",
        "preprocessed_group": "# 4. Trouble Shooting: Docking & H/W\n도킹 실패 및 센서 에러는 주로 로봇의 하드웨어인 IR 센서와 설비 측의 물리적 가이드인 도그플레이트 및 V마커 간의 정렬 문제로 인하여 발생한다.\n[10015] Docking failure due to IR sensor detection failure 에러는 AMR 밑면에 부착된 IR 센서가 설비 스토퍼의 도그플레이트(Dog Plate)를 정상적으로 감지하지 못할 때 발생한다.\n\n도킹 실패의 주요 원인은 설비 도그플레이트의 파손, V-마커(V-Marker)의 정렬 불량, 또는 AMR IR 센서의 높이 설정 오류 및 동작 이상이다.\n\n자동 복구 실패 시, WEB ACS 상에서 AMR이 올바른 위치에 도킹되었다면 JOB CANCEL과 ERROR RESET을 실행한 후 상태를 After Docking으로 변경하여 작업을 완료 처리한다.\n\n수동 조작이 필요한 경우로서 AMR이 비정상적인 위치에 있다면, JOB CANCEL과 ERROR RESET 실행 후 Move 명령으로 AMR을 Docking-Out 시키고 상태를 Before로 변경하여 재시도를 준비한다.\n\n하드웨어 점검 시에는 도그플레이트의 파손 여부, V-마커의 기울어짐 상태, AMR 하단 IR 센서의 작동 여부 및 높이 적절성을 확인한다.\n\nWEB ACS를 통한 센서 신호 확인 시, 0.3T AMR은 후면 도킹만 가능하며 rear_docking_check_sensor와 front_docking_check_sensor2 항목이 모두 ON 상태여야 도킹 완료(DOCK OK)로 간주한다.\n\nWEB ACS를 통한 센서 신호 확인 시, 1T AMR은 전방 또는 후방 도킹 방향에 따라 front_docking_check_sensor1 또는 rear_docking_check_sensor가 ON 상태여야 도킹 완료(DOCK OK)로 간주한다.\nAMR의 도킹 시도 중 진입 각도(Heading)가 허용 오차 범위를 초과하여 도킹이 중단된 경우, WEB ACS에서 Job Cancel을 클릭하여 작업을 취소한다.\n\n자동 복구 실패 시, AMR을 수동(Manual/JOG)으로 조작하여 도킹 스테이션에서 완전히 빠져나오도록(Docking-Out) 조치한다.\n\n수동 조작이 완료된 후에는 CALL-RETRY를 클릭하여 AMR의 도킹을 처음부터 다시 시도한다.\nAMR이 도킹 시도 중 맵(Map) 상의 티칭 좌표와 로봇 센서가 실제로 감지한 V-마커(V-Marker)의 위치가 일치하지 않아 도킹 대상을 찾지 못할 경우 [80018] ERROR_DOCK_NOT_FIND 에러가 발생한다.\n\nV-마커(V-Marker)가 수평 또는 수직 방향으로 정렬되지 않고 비뚤어지면 AMR의 도킹 실패 원인이 되며, 작업자는 이동 중 V-마커를 밟거나 강한 충격을 주어 위치가 변형되지 않도록 주의해야 한다.\n\n자동 복구 실패 시, 작업자는 WEB ACS에서 Job Cancel을 클릭하여 작업을 취소한 후 AMR을 수동으로 조작하여 도킹 스테이션에서 빠져나와(Docking-Out) 도킹 전(Before Docking) 상태로 되돌려야 한다.\n\n동일한 도킹 에러가 반복적으로 발생하는 경우, V-마커(V-Marker)의 정렬 상태를 교정하거나 마커를 교체해야 한다.",
        "textbook": "# BMA 자동화 시스템 기술 백서 (Technical Whitepaper)\n## 정밀 도킹 시스템의 메커니즘 및 하드웨어 무결성 분석 (Precision Docking Mechanism & H/W Integrity)\n\n### 1. 개요 (Executive Summary)\n\nBMA(Battery Module Assembly) 공정 내 AMR(Autonomous Mobile Robot)의 운용 효율성은 설비와의 물리적 결합, 즉 **도킹(Docking)**의 정밀도에 의해 결정된다. 도킹 프로세스는 단순한 위치 이동이 아니라, 글로벌 네비게이션(Global Navigation)에서 로컬 퍼셉션(Local Perception)으로 제어권이 이양되는 임계 구간이다.\n\n본 챕터에서는 AMR의 도킹 시퀀스 중 발생하는 물리적/논리적 불일치 현상을 시스템 아키텍처 관점에서 분석한다. 특히 Lidar 기반의 형상 인식(V-Marker)과 IR 센서 기반의 물리적 체결 확인(Dog Plate) 과정에서 발생하는 에러 코드 **[80018]** 및 **[10015]**의 발생 원리, 센서 데이터 흐름, 그리고 시스템 복구(Recovery)를 위한 FSM(Finite State Machine) 제어 로직을 심층적으로 다룬다.\n\n---\n\n### 2. 로컬 퍼셉션과 기하학적 정렬 메커니즘 (Local Perception & Geometric Alignment)\n\nAMR이 도킹 스테이션에 접근할 때, 시스템은 SLAM(Simultaneous Localization and Mapping) 기반의 전역 좌표계에서 Lidar 센서를 활용한 상대 좌표계로 주행 알고리즘을 전환한다. 이 과정에서 핵심적인 역할을 수행하는 것이 **V-마커(V-Marker)**이다.\n\n#### 2.1. V-마커 기반의 형상 인식 알고리즘\nV-마커는 단순한 표식이 아니라, Lidar 센서가 스캔한 포인트 클라우드(Point Cloud) 데이터 내에서 특정한 기하학적 특징(Feature)을 추출하기 위한 기준점(Reference)이다.\n\n*   **작동 원리:** AMR의 메인 컨트롤러는 Lidar로 스캔된 환경 데이터 중 'V'자 형태의 모서리(Corner) 특징점을 추출하고, 이를 사전에 정의된 템플릿과 매칭(Template Matching)하여 로봇의 현재 진입 각도(Heading)와 편차(Lateral Offset)를 계산한다.\n*   **[80018] ERROR_DOCK_NOT_FIND의 발생 메커니즘:**\n    이 에러는 **\"예측된 위치(Global Map)\"와 \"실측된 형상(Local Sensor)\" 간의 불일치**에서 기인한다.\n    1.  **좌표 불일치:** 맵 상에 티칭(Teaching)된 도킹 좌표에 도달했음에도 불구하고, Lidar 센서의 유효 탐지 범위(FOV) 내에서 V-마커의 특징점이 검출되지 않을 때 발생한다.\n    2.  **형상 왜곡:** 작업자의 실수로 V-마커를 밟거나 충격을 가해 마커가 물리적으로 변형(비뚤어짐)된 경우, Lidar 알고리즘은 이를 유효한 마커로 인식하지 못하고 노이즈(Noise)로 처리한다. 이는 패턴 매칭 점수(Score)가 임계값 미만으로 떨어지게 하여 도킹 대상을 찾지 못하는 결과를 초래한다.\n\n#### 2.2. 진입 각도(Heading) 제어 및 예외 처리\n도킹의 성공률은 진입 벡터의 정렬에 달려 있다. AMR이 계산한 진입 경로의 각도가 허용 오차(Tolerance) 범위를 초과할 경우, 물리적 충돌을 방지하기 위해 시스템은 즉시 도킹 프로세스를 중단(Abort)한다. 이는 설비와 로봇 간의 커넥터 파손을 방지하기 위한 **소프트웨어적 안전 인터록(Safety Interlock)**이다.\n\n---\n\n### 3. 물리적 체결 검증 시스템 (Physical Verification System)\n\nLidar가 AMR을 도킹 위치로 유도했다면, 최종적인 체결 완료 여부는 **IR(Infrared) 센서**와 **도그플레이트(Dog Plate)** 간의 상호작용을 통해 검증된다.\n\n#### 3.1. IR 센서와 도그플레이트의 광학적 상호작용\nAMR 하단에 부착된 IR 센서는 적외선을 방출하고, 설비 스토퍼(Stopper)에 장착된 도그플레이트(Dog Plate)에서 반사되어 돌아오는 광량을 측정하여 거리를 감지한다.\n\n*   **[10015] Docking failure due to IR sensor detection failure 분석:**\n    이 에러는 도킹 동작이 완료되었어야 하는 시점에, IR 센서의 신호(Digital Input)가 'High' 또는 'On' 상태로 전환되지 않았음을 의미한다.\n    *   **광학적 경로 차단 및 산란:** 도그플레이트가 파손되거나 표면이 오염된 경우, 적외선의 반사율(Reflectivity)이 저하되어 센서가 임계값 이상의 신호를 수신하지 못한다.\n    *   **설치 높이(Z-axis) 오차:** IR 센서는 특정 초점 거리(Focal Length)를 가진다. 센서의 높이 설정이 부적절하면 초점이 맞지 않아 감지 실패로 이어진다.\n\n#### 3.2. 기종별 센서 퓨전 로직 (Sensor Fusion Logic by Model)\nBMA 공정에는 0.3T와 1T 두 가지 타입의 AMR이 운용되며, 각기 다른 하중과 기구학적 특성에 따라 도킹 완료를 판단하는 센서 로직(Boolean Logic)이 상이하다.\n\n*   **0.3T AMR (단방향 도킹):**\n    *   구조적 특성상 후면 도킹(Rear Docking)만을 지원한다.\n    *   **판단 로직:** 안전 무결성을 위해 **AND 게이트** 로직을 사용한다.\n        $$Docking\\_Status = (rear\\_docking\\_check\\_sensor == ON) \\land (front\\_docking\\_check\\_sensor2 == ON)$$\n        두 센서가 동시에 활성화되어야만 시스템은 이를 'DOCK OK'로 간주한다.\n\n*   **1T AMR (양방향 도킹):**\n    *   전방 및 후방 진입이 모두 가능하다.\n    *   **판단 로직:** 진입 방향에 따른 **조건부 분기(Conditional Branching)** 로직을 수행한다.\n        *   전방 도킹 시: `front_docking_check_sensor1 == ON`\n        *   후방 도킹 시: `rear_docking_check_sensor == ON`\n\n---\n\n### 4. 시스템 복구 전략 및 FSM 제어 (Recovery Strategy & FSM Control)\n\n에러 발생 시 시스템을 정상 상태로 복귀시키기 위해서는 WEB ACS(Access Control System)를 통한 논리적 상태 제어와 현장 작업자의 물리적 조치가 병행되어야 한다.\n\n#### 4.1. 논리적 상태 복구 (Logical Recovery via ACS)\nACS 상에서의 조작은 시스템의 **교착 상태(Deadlock)**를 해제하는 과정이다.\n\n1.  **JOB CANCEL:** 현재 수행 중인 작업 스레드(Thread)를 강제 종료하여 AMR에 할당된 리소스를 해제한다.\n2.  **ERROR RESET:** PLC 및 상위 제어기의 에러 레지스터(Error Register)를 소거(Clear)한다.\n3.  **상태 동기화 (State Synchronization):**\n    *   **자동 복구 실패 시 (위치 정상):** 센서 오작동 등으로 인해 실제로는 도킹되었으나 시스템이 인지하지 못한 경우, 강제로 상태를 `After Docking`으로 변경하여 프로세스를 다음 단계로 넘긴다(Bypass).\n    *   **위치 비정상 시:** AMR이 엉뚱한 위치에 있다면, 상태를 `Before Docking`으로 변경하여 재진입을 준비시킨다.\n\n#### 4.2. 물리적 복구 및 재시도 (Physical Recovery & Retry)\n논리적 리셋만으로 해결되지 않는 물리적 정렬 불량은 수동 조작(Manual Operation)을 통해 해결해야 한다.\n\n*   **Docking-Out 메커니즘:**\n    자동 복구가 불가능할 때, 작업자는 수동(Manual/JOG) 모드로 AMR을 조작하여 도킹 스테이션의 간섭 영역(Interference Zone) 밖으로 완전히 이탈시켜야 한다. 이는 재진입 시 경로 계획(Path Planning) 알고리즘이 초기화된 상태에서 깨끗한 경로를 생성할 수 있도록 하기 위함이다.\n*   **CALL-RETRY:**\n    물리적 위치가 초기화된 후 `CALL-RETRY` 명령을 인가하면, 시스템은 V-마커 탐색부터 시작하는 전체 도킹 시퀀스를 처음부터 다시 수행한다.\n\n### 5. 결론 및 유지보수 제언\n\n도킹 실패는 대부분 하드웨어(센서, 마커, 플레이트)의 물리적 변형과 소프트웨어(알고리즘)의 허용 오차 간의 불일치에서 발생한다. 따라서 유지보수 엔지니어는 단순한 에러 리셋을 넘어 다음 사항을 주기적으로 점검해야 한다.\n\n1.  **V-마커의 기하학적 무결성:** 수직/수평 정렬 상태 및 표면 손상 여부.\n2.  **IR 센서의 신호 감도:** 도그플레이트와의 거리 및 높이(Height) 캘리브레이션.\n3.  **환경 노이즈 관리:** Lidar 및 IR 센서에 간섭을 줄 수 있는 외부 광원이나 장애물 제거.\n\n이러한 체계적인 접근 방식만이 BMA 공정의 가동률(Availability)을 극대화하고 다운타임을 최소화할 수 있다."
    },
    {
        "id": "# 5. Trouble Shooting: Model Specific",
        "preprocessed_group": "# 5. Trouble Shooting: Model Specific\nAMR의 기구적 특성인 Box Conveyor 또는 Pallet Lift 방식에 따라 발생하는 모델별 특화 에러를 확인하고, 자동 복구 실패 시 각 기구부의 특성에 맞는 조치 방법을 수행한다.\n0.3T AMR(Box Conveyor)에서 단순 작업 중단이나 박스 끼임이 발생하여 자동 복구가 실패한 경우, 작업자는 AMR 또는 설비 HMI를 조작하고 Payload를 수동으로 설정하여 조치한다.\n0.3T AMR(Box Conveyor)의 컨베이어 이송 중 박스 끼임 현상이나 작업 지연 알람으로 인해 단순 작업 중단이 발생한 경우, 0.3T AMR HMI 화면 좌측 하단의 Main 버튼(F1)을 클릭한 후 화면 중앙의 RESUME 버튼을 눌러 작업을 재개한다.\n설비 문제로 인해 0.3T AMR(Box Conveyor)이 도킹하지 못하고 대기하여 후속 AMR의 이동 경로를 방해하는 경우, 설비 HMI의 AMR INTERFACE 메뉴에서 Call Cancel, Call Create Pause 활성화(ON), Work Reset을 순서대로 실행한 후 0.3T AMR을 MS25(회수 포트)로 복귀시킨다.\n\n설비 점검이 완료되면 0.3T AMR(Box Conveyor)의 Check and Call을 실행하고 Create Pause를 비활성화(OFF)하며, 긴급한 상황이 발생할 경우 HMI의 Call Priority 버튼을 사용하여 0.3T AMR을 우선 호출한다.\n0.3T AMR(Box Conveyor)이 2열 공급 임무 수행 중 설비 포트의 물품 포화(Port Full)로 인해 작업을 수행하지 못하는 경우, WEB ACS에서 JOB Cancel과 Error Reset을 실행한 후 0.3T AMR HMI의 Manual 모드 인터페이스 화면에서 Close ALL을 클릭하여 열려 있는 컨베이어 도어를 모두 닫고 다시 AUTO 모드로 전환해야 하며, 설비 HMI에서 Call Cancel과 Work Reset을 거쳐 WEB ACS를 통해 Call Retry를 수행해야 한다.\n0.3T AMR(Box Conveyor)이 2열 공급 미션 중 1단 작업만 수행하고 알람이 발생하여 정지한 경우, WEB ACS에서 해당 JOB을 Cancel하고 Error Reset을 수행한 뒤, 0.3T AMR HMI를 Manual 모드로 전환하여 'Close all door'로 도어를 닫고 다시 AUTO 모드로 전환한다. 이후 WEB ACS의 Conveyor 탭 내 Payload Setting에서 공급하지 못한 자재는 '1EA – Full', 공급 완료된 칸은 '1EA – None'으로 수정한 후 JOB Complete(강제 완료)를 클릭하며, 설비 HMI에서 Call Cancel과 Work Reset을 차례로 수행한 뒤 WEB ACS를 AUTO Mode로 복귀시킨다.\n0.3T AMR(Box Conveyor)이 2열 회수 미션 수행 중 해당 회수 포트에 빈 박스(Empty Box)가 없어 작업을 수행할 수 없는 경우, 자동 복구 실패 시 설비 HMI에서 Call Cancel과 Work Reset을 실행하고 WEB ACS에서 JOB Cancel, Error Reset, Conveyor 탭의 Payload All Clear 설정을 순차적으로 진행한 후 Job complete와 Auto Mode를 적용한다.\n0.3T AMR(Box Conveyor)이 2열 회수 미션 중 1단 작업만 완료하고 알람이 발생한 경우, 작업자는 설비 HMI에서 Call Cancel과 Work Reset을 실행하고 WEB ACS에서 JOB Cancel과 Error Reset을 수행한 뒤, 0.3T AMR HMI를 Manual 모드로 전환하여 적재 위치 확인 및 Conveyor Door를 모두 닫고, WEB ACS의 Payload Setting을 #1: Empty, #2: None으로 수정한 후 MS25(회수 포트) 메뉴에서 Select Unload 1을 클릭하고 0.3T AMR HMI를 다시 AUTO 모드로 전환하여 조치한다.\n1T AMR(Pallet Lift)이 설비에 도킹했음에도 설비 측의 비정상적인 PLC 신호로 인해 작업을 시작하지 못하고 시간 초과 알람이 발생하는 경우, 자동 복구 실패 시 WEB ACS에서 Job Cancel과 Error Reset을 실행하고 설비 HMI에서 Work Reset을 통해 신호를 초기화한 뒤 WEB ACS에서 AMR 상태를 After Docking으로 변경하여 미션을 재시도하거나 완료 처리한다.\n1T AMR(Pallet Lift)이 BSA Outlet, BMA Outlet, BPA Empty SKID Outlet 구역에 도킹하였으나 지게차 작업 등 작업자 간섭으로 인해 들어 올릴 제품(Work)이 없어 작업 지연이 발생하는 경우, 자동 복구 실패 시 설비 HMI에서 Call Cancel 및 Work Reset을 수행하고 WEB ACS에서 Job Cancel, Error Reset, After Docking 순으로 조작하여 조치한다.\n\n알람 발생 후 해당 포트에 제품이 다시 준비되어 작업 재개가 가능한 경우, 수동 조작이 필요한 상황에서 설비 HMI의 Work Reset을 수행하고 WEB ACS에서 Job Cancel, Error Reset, After Docking 순으로 조작하여 공정을 재개한다.\n1T AMR(Pallet Lift)의 리프트 Up/Down 작업 후 SKID 휨 등으로 인해 제품 감지 센서가 미감지되어 자동 복구가 실패한 경우, WEB ACS에서 Job Cancel, Error Reset, Lift down을 수행하고 설비 HMI에서 Call Cancel과 Work Reset을 거쳐 AMR을 점검 장소로 이동시킨 후 작업자가 지게차로 해당 PLT를 수동 배출한다.\n\n1T AMR(Pallet Lift)의 Loading 작업 중 센서 조정이 필요하여 자동 복구가 실패한 경우, WEB ACS에서 JOB Cancel, Work Reset, Lift down을 수행하고 설비 HMI에서 Call Cancel과 Work Reset을 거친 뒤 AMR을 점검 장소로 이동시켜 센서를 점검하며 해당 SKID 이송을 위해 다른 AMR을 할당한다.\n\n1T AMR(Pallet Lift)의 Unload 작업 중 센서 조정이 필요하거나 잔류 감지 오류로 인해 자동 복구가 실패한 경우, WEB ACS에서 Job Cancel, Error Reset, Lift down, Job Complete(강제 완료), Payload Clear(적재물 없음 처리)를 수행하고 설비 HMI에서 Work Reset을 거친 뒤 AMR을 점검 장소로 이동시켜 센서를 점검한다.\n1T AMR의 리프트 구동 중 상한(Up) 또는 하한(Down) 센서가 감지되지 않아 동작이 멈춘 경우, Loading 작업 시에는 WEB ACS에서 Job Cancel, Error Reset, Lift down을 순차적으로 실행하고 설비 HMI에서 Call Cancel과 Work Reset을 수행한 후 1T AMR을 점검 장소로 이동하여 센서를 점검한다.\n\n1T AMR의 리프트 구동 중 상한(Up) 또는 하한(Down) 센서가 감지되지 않아 동작이 멈춘 경우, Unloading 작업 시에는 WEB ACS에서 Job Cancel, Error Reset, Lift down, Job Complete, Payload Clear를 순차적으로 실행하고 설비 HMI에서 Work Reset을 수행한 후 1T AMR을 점검 장소로 이동하여 센서를 점검한다.\n\n수동 조작이 필요한 경우, 점검이 완료된 1T AMR은 반드시 이상 유무를 확인한 후 후공정에 투입한다.\n1T AMR(Pallet Lift)의 물리적 센서 정상 작동 여부를 진단하기 위해서는 WEB ACS에서 해당 AMR을 클릭한 후 Information 탭의 Category를 IO로 변경하여 mobis_1ton_onboard_sensor 1/2(제품 감지) 및 mobis_1ton_lift_up/down_sensor(리프트 위치) 항목의 점등 상태(ON/OFF)를 확인한다.\n1T AMR(Pallet Lift)의 리프트 Up/Down 동작 완료 후 시스템상에서 작업 완료 처리가 되지 않는 경우, 1T AMR은 장비(EQP) 측의 'Unload REQ / Load REQ' 신호를 정상적으로 수신하지 못한 상태이므로 자동 복구 실패 시 WEB ACS에서 Job Cancel 및 Error Reset을 수행한 뒤 AMR을 작업 전 상태로 원복하고 After Docking 상태로 변경하여 PLC Manager Interface를 통해 수동으로 인터페이스 신호를 점검해야 한다.",
        "textbook": "# BMA 공정 자동화 시스템 기술 백서\n## 이기종 AMR 운용 시나리오별 예외 처리 및 시스템 복구 메커니즘 (Exception Handling & System Recovery Mechanism)\n\n### 1. 개요 (Overview)\n현대자동차그룹 BMA(Battery Module Assembly) 공정은 고중량의 배터리 모듈과 부품 박스를 이송하기 위해 **0.3T Box Conveyor AMR**과 **1T Pallet Lift AMR**이라는 이기종(Heterogeneous) 로봇 군집을 운용한다. 이 시스템의 안정성은 물리적 기구부(Physical Layer), 제어 로직(PLC Layer), 그리고 관제 시스템(ACS/MCS Layer) 간의 정밀한 동기화(Synchronization)에 의존한다.\n\n본 챕터에서는 각 AMR 모델의 기구적 특성에 따른 에러 발생 원인(Root Cause)을 공학적으로 분석하고, 시스템의 논리적 교착 상태(Logical Deadlock)를 해소하기 위한 데이터 흐름 및 복구 프로세스를 심층적으로 기술한다.\n\n---\n\n### 2. 0.3T AMR (Box Conveyor Type): 동적 이송 제어와 논리적 정합성\n0.3T AMR은 컨베이어 벨트와 도어(Door) 메커니즘을 통해 박스 단위의 자재를 이송한다. 이 과정에서 발생하는 문제는 주로 물리적 마찰에 의한 구동 실패와 시스템 상의 재고 데이터 불일치로 나뉜다.\n\n#### 2.1. 물리적 끼임(Jamming)과 토크 제어 메커니즘\n컨베이어 구동 중 발생하는 '박스 끼임' 현상은 모터의 부하 전류(Load Current)가 임계치를 초과하거나, 엔코더(Encoder)의 회전수와 지령 속도 간의 오차가 발생할 때 감지된다.\n*   **현상:** 이송 중 박스 끼임 또는 작업 지연 알람 발생.\n*   **복구 로직:** 시스템은 과부하 보호를 위해 모터 전원을 차단(Trip)한다. 작업자가 물리적 장애 요소를 제거한 후, HMI의 **[Main(F1) -> RESUME]** 시퀀스를 입력하는 것은 단순한 재시작이 아니다. 이는 모터 드라이버의 에러 레지스터(Error Register)를 소거(Clear)하고, 중단된 시점의 시퀀스 스텝(Sequence Step)을 다시 호출하여 PID 제어 루프를 재활성화하는 과정이다.\n\n#### 2.2. 도킹 실패와 경로 점유 교착 상태 (Deadlock Resolution)\nAMR이 설비와 도킹(Docking)을 시도하다 실패할 경우, 해당 AMR은 경로를 점유한 채 정지하여 후속 로봇의 이동을 막는 병목(Bottleneck) 현상을 유발한다.\n*   **해결 알고리즘:**\n    1.  **설비 측 리셋:** 설비 HMI의 **[Call Cancel]** 및 **[Call Create Pause ON]**은 설비가 더 이상 해당 미션에 대해 '준비 상태(Ready)'가 아님을 선언하고, 신규 호출 생성을 억제하여 큐(Queue)를 비우는 작업이다.\n    2.  **상태 초기화:** **[Work Reset]**은 설비 PLC와 AMR 간의 통신 핸드셰이킹(Handshaking) 비트를 강제로 `0`으로 초기화하여 통신 타임아웃 루프를 끊는다.\n    3.  **회수 명령:** 이후 AMR을 **MS25(회수 포트)**로 복귀시키는 것은 시스템 상에서 해당 로봇의 위치 점유를 해제하고, 안전 구역(Safe Zone)에서 재가동을 준비시키기 위함이다.\n\n#### 2.3. 다단 적재(2-Row) 미션에서의 데이터 불일치와 동기화\n0.3T AMR이 2열 공급/회수 미션을 수행할 때, 물리적 적재 상태와 ACS(ACS: Automated Control System) 상의 데이터(Payload Data)가 불일치하면 시스템은 안전을 위해 작업을 중단한다.\n\n*   **시나리오 A: 포트 포화(Port Full)로 인한 공급 실패**\n    *   **원인:** 설비 센서가 포트에 자재가 있음을 감지했으나, AMR은 공급 명령을 받고 진입한 경우 발생. 이는 물리적 센서 값과 상위 시스템의 재고 데이터 간의 레이턴시(Latency) 차이로 발생할 수 있다.\n    *   **복구 메커니즘:**\n        1.  **물리적 차단:** HMI Manual 모드의 **[Close ALL]**은 컨베이어 도어를 강제로 폐쇄하여 주행 중 자재 낙하를 방지하는 하드웨어 인터락(Interlock)을 체결하는 과정이다.\n        2.  **논리적 리셋:** WEB ACS의 **[JOB Cancel]** 및 **[Error Reset]**은 현재 수행 중인 트랜잭션을 롤백(Rollback)시킨다. 이후 **[Call Retry]**를 통해 상위 시스템이 최신 센서 데이터를 기반으로 작업을 재할당하도록 유도한다.\n\n*   **시나리오 B: 부분 작업 완료 (Partial Completion) 후 데이터 보정**\n    *   **원인:** 2단 작업 중 1단만 성공하고 에러가 발생한 경우, AMR은 \"작업 중\" 상태로 남게 되며, ACS는 여전히 2개의 자재를 모두 가진 것으로 인식할 수 있다.\n    *   **데이터 동기화 (Digital Twin Synchronization):**\n        *   작업자는 WEB ACS의 **Payload Setting**을 수정하여 디지털 트윈 데이터를 물리적 현실과 일치시켜야 한다.\n        *   공급 실패한 자재는 **'1EA – Full'**, 공급 완료된 칸은 **'1EA – None'**으로 설정한다.\n        *   이후 **[JOB Complete]**를 실행하면, 시스템은 해당 미션을 '강제 성공'으로 처리하고 재고 데이터를 업데이트하여 다음 프로세스로 넘어갈 수 있게 한다.\n\n*   **시나리오 C: 회수 미션 중 빈 박스 부재 (Empty Box Missing)**\n    *   **원인:** 회수 포트에 빈 박스가 있다는 정보(Data)를 바탕으로 로봇이 도착했으나, Lidar 또는 근접 센서가 박스를 감지하지 못한 경우.\n    *   **복구:** 설비와 ACS의 작업을 취소한 후, **[Payload All Clear]**를 수행한다. 이는 로봇이 \"아무것도 싣지 않았다\"는 상태로 논리적 정의를 내리는 것이며, 이를 통해 로봇은 다음 명령을 수신할 수 있는 Idle 상태로 전환된다.\n\n---\n\n### 3. 1T AMR (Pallet Lift Type): 고중량 리프팅 역학 및 센서 퓨전\n1T AMR은 유압 또는 전동 리프트를 사용하여 스키드(Skid)를 들어 올린다. 이 과정에서는 고중량에 의한 구조적 변형과 센서 정밀도 간의 상관관계가 핵심적인 기술적 이슈로 작용한다.\n\n#### 3.1. PLC 신호 타임아웃과 핸드셰이킹 프로토콜\nAMR이 도킹에 성공했음에도 작업이 시작되지 않는 현상은 주로 **PLC Handshaking Protocol**의 실패에서 기인한다.\n*   **메커니즘:** AMR은 도킹 후 `Docking_Complete` 신호를 송출하고, 설비 PLC로부터 `Work_Start` 신호를 대기한다. 특정 시간(Timeout) 내에 응답이 없으면 교착 상태를 방지하기 위해 에러를 발생시킨다.\n*   **조치:** WEB ACS에서 **[After Docking]** 상태로 변경하는 것은, 시스템에게 \"로봇은 이미 물리적으로 도킹 위치에 있으니, 주행 단계를 생략하고 즉시 작업(Work) 단계부터 재시도하라\"는 명령을 내리는 것이다. 이는 불필요한 주행 시간을 단축하고 통신 시퀀스만 재시작하는 효율적인 복구 전략이다.\n\n#### 3.2. 스키드 변형(Deformation)과 센서 미감지\n고중량 배터리 모듈을 적재한 스키드는 물리적 하중에 의해 미세하게 휘어질 수 있다(Deflection).\n*   **원인:** 리프트 Up/Down 시, 스키드의 휨으로 인해 AMR의 광학 센서나 근접 센서(Proximity Sensor)의 감지 범위(Detection Zone)를 벗어나는 경우, 시스템은 안전을 위해 동작을 즉시 정지한다.\n*   **복구 프로세스:**\n    1.  **강제 하강:** WEB ACS의 **[Lift down]** 명령을 통해 유압/모터 밸브를 개방하여 리프트를 원점으로 복귀시킨다.\n    2.  **수동 배출:** 센서 오차 범위를 벗어난 스키드는 자동화 설비로 핸들링이 불가능하므로, AMR을 점검 장소로 이동시킨 후 지게차를 이용해 수동으로 라인에서 배출(Reject)한다.\n\n#### 3.3. 센서 I/O 진단 및 인터페이스 신호 점검\n물리적 센서의 고장인지, 단순한 위치 오차인지 판별하기 위해 엔지니어는 로우 레벨(Low-level) 데이터에 접근해야 한다.\n*   **진단 방법:** WEB ACS의 **Information 탭 -> IO Category**에서 `mobis_1ton_onboard_sensor 1/2` (제품 감지) 및 `mobis_1ton_lift_up/down_sensor` (리프트 상/하한 리미트 스위치)의 비트 상태(ON/OFF)를 실시간으로 모니터링한다.\n*   **인터페이스 신호 복구:** 리프트 동작은 완료되었으나 시스템 상 완료 처리가 안 되는 경우, 이는 장비(EQP) 측의 `Unload REQ / Load REQ` 신호가 끊긴(Drop) 상태이다. 이때는 **PLC Manager Interface**를 통해 수동으로 신호를 트리거(Trigger)하여 논리적 흐름을 이어주어야 한다.\n\n#### 3.4. 잔류 감지 오류 및 센서 재조정\nUnload 작업 중 잔류 감지(Residual Detection) 오류가 발생하면, 실제로는 짐을 내렸으나 센서는 여전히 짐이 있다고 판단할 수 있다.\n*   **조치:** **[Job Complete(강제 완료)]** 및 **[Payload Clear]**를 통해 소프트웨어적으로 \"짐 없음\" 상태를 확정 짓는다. 이후 해당 AMR은 반드시 점검 장소로 이동하여 센서의 감도(Sensitivity) 및 설치 각도를 재조정(Calibration)해야 한다. 이는 센서의 히스테리시스(Hysteresis) 특성이 변했거나, 외란광(Ambient Light) 등의 노이즈가 원인일 수 있기 때문이다.\n\n---\n\n### 4. 결론: 시스템 무결성을 위한 표준 운영 절차 (SOP)\nBMA 공정의 자동화 시스템 복구 절차는 단순히 에러를 끄는 것이 아니라, **[물리적 상태(Physical State)] - [제어 신호(PLC Signal)] - [데이터 상태(ACS Data)]** 의 3요소를 일치시키는 과정이다.\n\n1.  **설비(Equipment):** `Call Cancel`과 `Work Reset`을 통해 PLC의 시퀀스 메모리를 초기화한다.\n2.  **관제(ACS):** `Job Cancel`과 `Payload Setting`을 통해 데이터베이스의 트랜잭션 무결성을 확보한다.\n3.  **로봇(AMR):** `Manual Mode` 조작과 `Sensor Check`를 통해 기구부의 안전을 확보하고 재가동 준비를 마친다.\n\n모든 수동 조작 및 점검이 완료된 AMR은 반드시 이상 유무를 최종 확인(Verification)한 후 후공정에 투입되어야 하며, 이는 전체 라인의 가동률(Availability)과 직결되는 핵심 원칙이다."
    },
    {
        "id": "# 6. Operational Manual: Control Tools (조작 및 유지보수 매뉴얼)",
        "preprocessed_group": "# 6. Operational Manual: Control Tools (조작 및 유지보수 매뉴얼)\n현장 운영자는 Operational Manual을 통해 설비(EQP) 및 시스템(ACS)을 제어하고, AMR의 센서 및 도킹 설비를 유지보수한다.\nEQP HMI의 AMR Interface 메뉴는 설비 화면 우측에 위치하며, 작업자가 AMR 관련 핵심 기능을 조작하고 구체적인 운영 시나리오에 따라 설비를 제어하는 용도로 사용한다.\nEQP HMI의 Call Cancel 기능은 설비에서 이미 생성된 AMR 호출(Call)을 취소하는 기능이며, 반드시 AMR이 도킹하기 전에 수행해야 한다.\n\n수동 조작이 필요한 경우, EQP HMI 우측의 Call Cancel 버튼을 클릭한 후 좌측 하단의 화살표(>)를 눌러 명령을 실행하며, 상태창에서 Response Call Cancel 및 Bit Clear(Request ID, Call Request, Call Response, Robot Assigned, Call Cancel)를 확인한다.\n\n차종 교체 시 설비를 AUTO에서 Manual로 전환하여 신규 차종으로 변경했음에도 신규 콜이 생성되지 않는 경우, Call Cancel을 실행하여 이전 차종의 콜을 삭제한 후 작업을 시작한다.\n\n시업 및 라인 재개 시 작업자가 수동으로 재공을 조절하거나 재고 조사 후 설비 상태가 변경되어 이전 공급 콜이 유지되는 경우, Call Cancel을 실행하여 잘못된 콜을 삭제한다.\n\n라인 점검 중 설비 에러 조치 지연으로 인해 대기 중인 AMR이 물류 정체를 유발하는 경우, Call Cancel을 실행하여 해당 AMR을 복귀시킨다.\nEQP HMI의 Call Create Pause 기능은 설비가 자재 투입 또는 배출 조건을 충족하더라도 AMR 호출 신호를 생성하지 않도록 제어하는 기능이다.\n\n이미 AMR 호출이 생성된 상태에서 호출을 취소하고자 할 때는 Call Create Pause 대신 Call Cancel 기능을 사용해야 한다.\n\n수동 조작이 필요한 경우, 설비 HMI 우측의 Call Create Pause 버튼을 클릭하여 버튼이 활성화(ON)된 상태를 확인한다.\n\nAMR 자동 공급이 불필요한 리워크 제품 연속 투입 시에는 Call Create Pause 기능을 활성화하여 호출 생성을 차단한다.\n\n작업자가 지게차 등을 이용해 수동으로 자재를 투입하거나 배출하는 동안에는 Call Create Pause 기능을 사용하여 설비의 자동 호출 신호 생성을 일시 정지한다.\nEQP HMI의 Call Priority(우선 호출) 기능은 특정 설비의 호출을 최우선 순위로 설정하여 대기 중인 AMR을 가장 먼저 할당받게 하는 기능이다.\n\nEQP HMI의 Call Priority 기능은 1회만 활성화되며, 해당 작업 완료 후 다음 호출부터는 정상 우선순위(Priority)가 적용된다.\n\n수동 조작이 필요한 경우, 설비 HMI 우측의 Call Priority 버튼을 클릭하고 좌측 하단의 화살표(>)를 눌러 명령을 실행한 뒤 상태창에서 활성화 여부를 확인한다.\n\n긴급 자재 공급이 필요하거나 NG 팔레트, 셀 공팔레트, BMA 완제품 및 공팔레트가 배출되지 않아 설비 막힘(Blocking)이 발생한 경우, EQP HMI의 Call Priority 기능을 사용하여 긴급 배출을 수행한다.\nEQP HMI의 Forced Docking(강제 도킹) 기능은 설비와 AMR의 Call Type이 일치하지 않더라도 강제로 도킹 및 작업을 진행하게 하는 기능이다.\n\nForced Docking 기능은 1회만 활성화되며, 다음 도킹 시점부터는 설비와 AMR의 Call Type 일치 여부를 확인하는 정상 로직이 다시 적용된다.\n\n수동 조작이 필요한 경우, 설비 HMI 우측의 Forced Docking 버튼을 클릭한 후 좌측 상태창에서 Call Request, Call Response, Robot Assigned 상태를 확인한다.\n\n타 라인 긴급 지원이나 리워크 투입을 위해 기존 라인의 콜을 무시하고 다른 라인의 AMR을 수동으로 투입해야 하는 경우 Forced Docking 기능을 사용한다.\n\nBSA #1라인 자동 공급 중 작업을 취소하고 BSA #2라인에 강제로 수동 공급하려는 경우, BSA #1라인의 Call Cancel을 실행하여 기존 콜을 제거한 후 BSA #2라인에서 Forced Docking 또는 Priority를 실행한다.\n\n지게차를 이용해 수동으로 자재를 투입할 때 컨베이어가 작동하지 않는 경우, HMI에서 컨베이어 수동 구동을 실시한다.\n\n공 팔레트 회수 미션이 생성된 상태에서 지게차로 팔레트를 먼저 회수한 경우, 배출부의 Call Cancel을 실행하여 기존 콜을 제거해야 한다.\nAMR이 BMA 배출 라인에서 품질 검사를 위해 정차하거나 수동 위치 조정이 필요한 경우, WEB ACS에서 해당 AMR 호기를 선택하고 BMA 배출 포트에서 Docking-OUT이 완전히 완료된 것을 확인한 후 JOB CANCEL을 클릭한다.\n\n도킹 아웃 도중 JOB CANCEL을 클릭하면 PLC 신호 꼬임(Interface Error)이 발생할 수 있으므로 주의해야 하며, 수동 조작이 필요한 경우 Unlock 버튼을 클릭하여 JOG 버튼을 활성화한 뒤 키보드나 화면 버튼으로 주변 장애물에 주의하며 운전한다.\n\n수동 조작 및 검사가 완료된 후에는 CALL-RETRY 버튼을 클릭하여 AMR을 BMA 배출에서 BMA 자동창고로 이동하는 자동 미션으로 복귀시킨다.\nAMR Sensor 점검 및 V-marker ASSY 상태 관리 시, 차상 제품감지센서는 FESTO 사의 SOEG-RTH-M18-PS-K-2L 모델을 2개 사용하며, 리프트용 근접센서는 FESTO 사의 SIEH-M12B-PS-S-L 모델을 2개 사용하고, 도킹용 근접센서는 AUTONICS 사의 PRT12-8DN2 모델을 2개 사용한다.\n자동 복구 실패 시, 작업자는 1T AMR 차상에 설치된 제품감지센서의 상태를 점검하고 필요에 따라 감도 및 위치를 조정한다.\n1. BMA/BSA SKID용 콘-타입(Cone Type) AMR Sensor(호기: R_107~135)를 분해할 경우, T-렌치를 사용하여 커버(1)은 2.5mm, 커버(2)는 3mm 나사를 풀고 센서가 낙하하지 않도록 주의하며 제거한다.\n\n2. BMA/BSA SKID용 콘-타입(Cone Type) AMR Sensor의 동작 상태는 후면 LED를 통해 확인하며, 대기 시에는 녹색 LED가 점등되고 감지 시에는 녹색과 노란색 LED가 동시에 점등된다.\n\n3. BMA/BSA SKID용 콘-타입(Cone Type) AMR Sensor의 감지 높이를 조정할 경우, 일자 정밀드라이버를 사용하여 반시계 방향으로 최소 높이를 설정한 후 시계 방향으로 돌려가며 높이를 맞춘다.\n\n4. BMA SKID에 장착된 콘-타입(Cone Type) AMR Sensor의 권장 세팅 높이는 20 ~ 25 mm이다.\n\n5. BSA SKID에 장착된 콘-타입(Cone Type) AMR Sensor는 프레임이 없는 구조이므로 PLT 하부 커버를 감지할 수 있도록 95 ~ 100 mm 높이로 설정한다.\n\n6. BMA/BSA SKID용 콘-타입(Cone Type) AMR Sensor의 감지 높이를 100mm 초과로 설정할 경우, 리프트가 하강한 상태에서도 제품을 오감지할 수 있으므로 주의한다.\n\n7. BMA/BSA SKID용 콘-타입(Cone Type) AMR Sensor의 조립 완료 후 수동 확인이 필요한 경우, WEB ACS의 Information 내 IO 탭에서 onboard_sensor_1(전방) 및 onboard_sensor_2(후방)의 상태가 감지 시 녹색, 미검출 시 빨간색으로 표시되는지 확인한다.\n1. 셀 공급 및 회수용 Type B 어태치-타입 AMR(R_101~106)의 센서를 분해할 때는 상부 커버 제거, Push 버튼 제거, 센서 브라켓 제거 순서로 탈거한다.\n2. 셀 공급 및 회수용 Type B 어태치-타입 AMR(R_101~106)의 센서 동작 상태는 LED가 녹색일 때 대기, 녹색과 노란색이 동시에 점등될 때 동작 중임을 나타낸다.\n3. 셀 공급 및 회수용 Type B 어태치-타입 AMR(R_101~106)의 센서 감지 범위는 센서 버튼을 누른 상태에서 감지가 확인되는 지점까지 조정하며, 권장 설정 높이는 5mm이다.\n4. 셀 공급 및 회수용 Type B 어태치-타입 AMR(R_101~106)의 센서 조립 완료 후에는 WEB ACS의 IO 탭을 통해 정상 동작 여부를 최종 확인한다.\n자동 복구 실패 시, 작업자는 AMR 리프트 및 도킹 장치에 부착된 근접센서의 감지 상태와 이물질 부착 여부를 직접 점검해야 한다.\nAMR 리프트 UP/DOWN 센서의 점검을 위해 2.5mm T-렌치를 사용하여 보전용 커버를 탈거한 후 리프트 동작 시 센서 LED의 점등 여부를 확인한다.\n\n수동 조작이 필요한 경우, 17mm 스패너로 고정 너트를 풀어 AMR 리프트 센서와 검출체(프레임) 간의 거리를 2mm로 조정한다.\n\nAMR 리프트 센서의 높이 조정이 필요한 경우, Down 센서를 기준으로 Up 센서까지의 거리를 100mm가 되도록 녹색 표시 볼트를 이용하여 조정한다.\n1T AMR의 도킹 검지 센서는 전방과 후방에 각 1개씩 장착되어 있으며, 0.3T AMR의 도킹 검지 센서는 후방에 2개 장착되어 있다.\n\nAMR 도킹 검지 센서의 높이를 조정할 경우, 지면으로부터 16mm(브라켓 기준 19mm) 높이에 세팅용 지그(Zig)를 배치하고 센서 높이를 맞춘 후 너트를 체결하여 고정한다.\n\nAMR 도킹 검지 센서의 동작을 확인하는 경우, 실제 도킹 포인트에 진입하여 ACS(AMR Control System)의 IO 탭에서 센서 감지 여부를 점검한다.\nV-marker ASSY는 V-marker, 오버런 스토퍼, 도그플레이트 ASSY, 자동충전기 브라켓으로 구성된다.\n\nV-marker의 위치나 각도가 틀어져 AMR이 도킹 위치를 찾지 못하는 경우, 작업자는 V-marker의 정렬 상태를 점검하고 재조립 또는 교체를 실시한다.\n\nV-marker의 파손을 방지하기 위해 작업자가 V-marker를 밟거나 발로 차지 않도록 안전 교육을 실시해야 한다.\n\n도그플레이트의 각도가 틀어져 도킹 완료 후 '센서 미감지' 에러(10015)가 발생하는 경우, 작업자는 도그플레이트의 위치를 교정하거나 파손 시 부품을 교체한다.",
        "textbook": "# BMA 자동화 시스템 기술 백서 (Technical Whitepaper)\n## 이기종 제어 시스템 간의 상호 운용성 및 센서 피드백 메커니즘\n**(Interoperability and Sensory Feedback Mechanisms in Heterogeneous Control Systems)**\n\n---\n\n### 1. 서론 (Introduction)\n\n현대자동차그룹 BMA(Battery Module Assembly) 공정은 물리적 계층(Physical Layer)의 AMR(Autonomous Mobile Robot)과 논리적 계층(Logical Layer)의 상위 관제 시스템(ACS/MCS), 그리고 제어 계층(Control Layer)의 설비 PLC가 유기적으로 결합된 복합 시스템(Cyber-Physical System)입니다. 본 챕터에서는 단순한 조작 절차를 넘어, 각 시스템 간의 **핸드쉐이킹(Handshaking) 프로토콜**, **센서의 공학적 감지 원리**, 그리고 **예외 상황(Exception Handling)에서의 논리적 인과관계**를 심층적으로 분석합니다. 엔지니어는 이를 통해 시스템의 블랙박스 내부에서 발생하는 데이터 흐름과 물리적 상호작용을 이해해야 합니다.\n\n---\n\n### 2. 설비-AMR 인터페이스 제어 논리 및 교착 상태 방지 (EQP-AMR Interface Logic)\n\n설비(EQP)와 AMR 간의 통신은 비동기적(Asynchronous) 환경에서 결정론적(Deterministic) 동작을 보장해야 합니다. EQP HMI의 제어 도구들은 이러한 통신 과정에서 발생할 수 있는 논리적 교착 상태(Deadlock)나 레이스 컨디션(Race Condition)을 해결하기 위해 설계되었습니다.\n\n#### 2.1. 호출 취소(Call Cancel)와 레지스터 초기화 메커니즘\n`Call Cancel` 기능은 단순히 명령을 철회하는 것이 아니라, PLC 메모리 내의 통신 레지스터를 강제로 소거(Clear)하는 **'상태 리셋(State Reset)'** 과정입니다.\n\n*   **작동 원리:**\n    1.  **트리거:** 운영자가 HMI에서 Call Cancel을 실행.\n    2.  **내부 로직:** PLC는 `Request ID`, `Call Request`, `Call Response`, `Robot Assigned` 비트를 순차적으로 `0`으로 초기화합니다.\n    3.  **필요성:** AMR이 도킹하기 전(Pre-Docking) 단계에서만 유효한 이유는, 도킹 프로세스가 시작되면 설비와 로봇 간의 하드와이어드(Hard-wired) 또는 광통신 인터록이 체결되기 때문입니다. 이 상태에서 논리적 호출만 취소할 경우, 물리적 연결은 유지된 채 논리 링크만 끊어지는 **'고아 상태(Orphaned State)'**가 발생하여 시스템 멈춤을 유발합니다.\n*   **적용 시나리오:**\n    *   **차종 교체(Model Change):** `AUTO`에서 `Manual`로 전환 시, 기존 차종에 대한 호출 ID가 잔존하면 신규 차종의 호출 생성을 방해(Blocking)합니다. 이때 Call Cancel은 잔존 ID를 플러시(Flush)하여 메모리 스택을 비웁니다.\n    *   **재공 불일치:** 라인 재개 시 물리적 재고와 시스템상 재고 데이터(WIP Count)가 불일치할 경우, 잘못 생성된 공급 요청을 삭제하여 물류 병목을 해소합니다.\n\n#### 2.2. 호출 생성 일시 정지(Call Create Pause)와 흐름 제어\n`Call Create Pause`는 설비의 센서가 자재 투입/배출 조건을 만족하더라도(Trigger Condition Met), 상위 시스템으로의 신호 송출을 물리적으로 차단(Gating)하는 기능입니다.\n\n*   **논리적 차이점:** `Call Cancel`이 이미 생성된 트랜잭션을 파괴하는 것이라면, `Call Create Pause`는 트랜잭션 생성 자체를 억제하는 **'게이트 키퍼(Gatekeeper)'** 역할을 수행합니다.\n*   **공학적 적용:**\n    *   **리워크(Rework) 공정:** 불량품 재투입 시, 정상적인 자재 소진 로직에 의해 불필요한 자재 공급 요청이 발생할 수 있습니다. 이를 방지하기 위해 자동 호출 트리거를 마스킹(Masking)합니다.\n    *   **수동 개입 시 안전 확보:** 지게차 작업 등 인간이 개입하는 동안 시스템의 비동기적 호출 생성을 막아, AMR과 작업자 간의 동선 중첩을 원천 차단합니다.\n\n#### 2.3. 우선순위 역전(Priority Inversion) 및 강제 도킹(Forced Docking)\nACS의 스케줄링 알고리즘은 기본적으로 FIFO(First-In-First-Out) 또는 최적 경로 기반이지만, 현장 상황에 따라 이를 오버라이드(Override)해야 할 때가 있습니다.\n\n*   **Call Priority (인터럽트 요청):** 설비 막힘(Blocking) 발생 시, 해당 설비의 호출에 최상위 가중치를 부여하여 큐(Queue)의 맨 앞으로 이동시킵니다. 이는 1회성 인터럽트(One-shot Interrupt)로 동작하며, 작업 완료 후 시스템은 즉시 표준 스케줄링 로직으로 복귀합니다.\n*   **Forced Docking (유효성 검사 우회):**\n    *   **정상 로직:** 설비의 `Call Type`과 AMR의 `Job Type`이 일치하는지 비트 단위로 비교(Bitwise Comparison)하여, 불일치 시 도킹을 거부합니다.\n    *   **강제 로직:** 긴급 지원이나 라인 간 교차 투입 시, 이 비교 로직을 바이패스(Bypass)하여 물리적 도킹을 승인합니다.\n    *   **주의사항:** BSA #1라인에서 #2라인으로 전환 시, 반드시 기존 라인의 잔존 신호를 `Call Cancel`로 소거해야 합니다. 그렇지 않으면 두 라인의 신호가 중첩되어 **'이중 할당(Double Assignment)'** 오류가 발생합니다.\n\n---\n\n### 3. 자율주행 시스템의 예외 처리 및 신호 무결성 (AMR Navigation & Signal Integrity)\n\nAMR의 자율주행은 정밀한 위치 추정(Localization)과 상위 시스템과의 끊임없는 통신에 의존합니다.\n\n#### 3.1. 작업 취소(Job Cancel)와 도킹 시점의 임계성\nWEB ACS를 통한 `JOB CANCEL` 명령은 AMR의 미션 큐를 삭제합니다. 그러나 이 명령의 실행 시점은 시스템 안정성에 치명적인 영향을 미칩니다.\n\n*   **Docking-OUT 완료 후 실행 원칙:**\n    *   도킹 중(Docking-IN/Busy)에는 AMR과 설비 간의 광통신 또는 근거리 무선 통신을 통해 I/O 신호가 실시간으로 교환됩니다(예: E-Stop 연동, 컨베이어 구동 신호).\n    *   이 과정에서 강제로 Job을 취소하면, PLC는 통신 두절을 감지하고 **'Interface Error'**를 발생시킵니다. 이는 단순 에러가 아니라, 설비와 로봇 양쪽의 안전 회로가 트립(Trip)되는 현상입니다.\n    *   따라서 반드시 물리적/논리적 연결이 해제된 `Docking-OUT` 상태 확인 후 명령을 실행해야 합니다.\n\n#### 3.2. 수동 조작(Manual Jog)과 서보 제어\nAMR이 위치를 잃거나(Delocalization) 장애물에 갇혔을 때, `Unlock` 기능을 통해 제어권을 자동(Auto)에서 수동(Manual)으로 전환합니다. 이는 서보 모터의 위치 제어 루프(Position Control Loop)를 해제하고, 작업자의 입력에 따라 속도 제어(Velocity Control) 모드로 구동함을 의미합니다. 복구 후 `CALL-RETRY`는 중단된 시퀀스의 포인터를 찾아 자동화 루프를 재개시키는 명령어입니다.\n\n---\n\n### 4. 센서 시스템의 물리학적 특성 및 캘리브레이션 (Sensor Physics & Calibration)\n\nBMA 공정의 신뢰성은 센서 데이터의 정확도에 좌우됩니다. 각 센서는 고유의 물리적 검출 원리를 가지며, 이에 따른 정밀한 튜닝이 요구됩니다.\n\n#### 4.1. 광학식 제품 감지 센서 (Photoelectric Sensors)\nAMR 차상에는 FESTO사의 `SOEG-RTH-M18-PS-K-2L` (확산 반사형) 모델이 사용됩니다.\n\n*   **작동 원리:** 발광부에서 쏘아진 빛이 물체(배터리 모듈/SKID)에 반사되어 수광부로 돌아오는 광량을 측정합니다.\n*   **히스테리시스(Hysteresis)와 감지 높이:**\n    *   **Cone Type (BMA/BSA SKID):** 권장 높이 **20~25mm**. 이 센서는 배경 억제(Background Suppression) 기능이 제한적일 수 있습니다. 만약 높이를 **100mm 초과**로 설정하면, 리프트 하강 시 바닥면(Floor)을 제품으로 오인하는 **'허위 양성(False Positive)'** 신호가 발생합니다.\n    *   **Attach Type (Type B):** 권장 높이 **5mm**. 감지 거리가 매우 짧게 설정된 이유는 난반사에 의한 노이즈를 최소화하고, 대상 물체의 유무만을 명확히 판별하기 위함입니다.\n*   **상태 표시:** 녹색 LED(전원/대기)와 노란색 LED(출력/감지)의 조합을 통해 센서의 동작 상태(N.O/N.C) 및 안정 영역 진입 여부를 시각적으로 판별합니다.\n\n#### 4.2. 유도형 근접 센서 (Inductive Proximity Sensors)\n리프트 및 도킹 감지에는 FESTO `SIEH-M12B` 및 AUTONICS `PRT12-8DN2`가 사용됩니다.\n\n*   **작동 원리:** 센서 전면부에서 고주파 자기장을 형성하고, 금속 물체(검출체)가 접근할 때 발생하는 와전류(Eddy Current) 손실을 감지하여 스위칭합니다.\n*   **정밀 튜닝 (Gap Control):**\n    *   **리프트 센서:** 검출체(프레임)와의 거리를 **2mm**로 유지해야 합니다. 이는 자기장의 유효 검출 범위(Sensing Distance) 내에서 가장 안정적인 신호 대 잡음비(SNR)를 확보하는 거리입니다.\n    *   **Up/Down 스트로크:** Down 센서 기준 Up 센서까지 **100mm** 간격은 리프트의 기계적 스트로크와 일치해야 하며, 이를 벗어날 경우 리프트 모터의 과부하(Overload)나 위치 결정 실패를 유발합니다.\n\n---\n\n### 5. 인프라스트럭처와 기하학적 인식 (Infrastructure & Geometric Recognition)\n\nAMR은 주변 환경의 특징점(Feature)을 인식하여 자신의 위치를 계산합니다.\n\n#### 5.1. V-Marker와 Lidar SLAM\nV-Marker는 단순한 반사판이 아니라, AMR의 Lidar 센서가 인식하는 **기하학적 랜드마크(Geometric Landmark)**입니다.\n\n*   **인식 메커니즘:** AMR의 네비게이션 알고리즘은 스캔된 포인트 클라우드(Point Cloud) 데이터와 사전에 정의된 V-Marker의 형상 템플릿을 매칭합니다.\n*   **변형의 영향:** 작업자의 충격으로 V-Marker의 각도가 틀어지면, 템플릿 매칭 점수(Matching Score)가 하락하여 AMR은 도킹 위치를 특정하지 못하고 배회하거나 정지합니다.\n\n#### 5.2. 도그플레이트(Dog Plate)와 물리적 정렬 확인\n도그플레이트는 도킹의 최종 단계에서 기구적 정렬을 확정하고 센서를 트리거하는 물리적 인터페이스입니다.\n\n*   **에러 코드 10015 (센서 미감지):** 도킹 동작은 완료되었으나, 도그플레이트가 센서 감지 범위(Sensing Area)에 들어오지 않았음을 의미합니다. 이는 AMR의 정차 위치 오차(Navigation Error) 또는 도그플레이트의 기구적 변형(Mechanical Deformation)에 기인합니다. 따라서 단순 재시도보다는 플레이트의 위치 교정 및 파손 여부 점검이 선행되어야 합니다.\n\n---\n\n**결론:** BMA 공정의 안정적인 운영은 HMI의 논리적 제어, AMR의 통신 프로토콜 준수, 그리고 센서 하드웨어의 정밀한 물리적 세팅이 삼위일체를 이룰 때 달성됩니다. 운영자와 엔지니어는 각 에러 코드와 현상 이면에 존재하는 이러한 시스템적 인과관계를 파악하여 근본적인 원인을 해결해야 합니다."
    },
    {
        "id": "# 7. Appendix",
        "preprocessed_group": "# 7. Appendix\nMCS(Material Control System)는 부품 재고를 관리하고 작업 할당을 내리는 최상위 제어 시스템으로서, PLC(Programmable Logic Controller) 신호를 통해 부품 보충 요청을 ACS(AMR Control System)에 전달한다.\n\nPLC(Programmable Logic Controller)는 공장 자동화 시스템에서 센서의 입력 신호를 받아 프로그래밍된 로직에 따라 연산을 수행하고 모터나 밸브 등의 외부 장치를 제어하는 산업용 컴퓨터이다.\n\nWMS(Warehouse Management System)는 창고 내 재고, 입출고 및 보관 위치를 효율적으로 관리하는 시스템이다.\n\nBMA(Battery Module Assembly)는 배터리 셀들을 결합하여 하나의 모듈로 제작하는 배터리 모듈 조립 공정을 의미한다.\n\nBSA(Battery System Assembly)는 BMA 공정에서 제작된 배터리 모듈들을 차량 장착용 최종 시스템으로 조립하는 배터리 시스템 조립 공정을 의미한다.\n\nCELL은 에너지를 저장하고 방출하는 배터리의 가장 기본적인 단위인 배터리 셀을 의미한다.\n\nL/C(Lower Case)는 배터리 시스템의 하단부를 구성하는 부품인 하부 케이스를 의미한다.\n\nLWR CASE(LL)는 배터리 시스템의 하부 케이스를 지칭하며, 문서 내에서는 LL이라는 약어로 사용된다.\n\nSKID RETURN(RC)은 물품 운반용 스키드(Skid)를 회수하거나 재활용하는 라인 또는 구역을 의미하며, 문서 내에서는 RC라는 약어로 사용된다.\n\nMS(Material Storage)는 BMA 또는 BSA 공정에 필요한 다양한 부품들을 보관하는 부품 창고를 의미한다.\n\nCS(BMA CELL)는 배터리 셀이 BMA 공정으로 공급되거나 처리되는 구역인 BMA CELL 공정을 의미한다.\n\nMC(BMA)는 배터리 모듈이 조립되는 핵심 공정 구역인 BMA 공정을 의미한다.\n\nMW(Module Warehouse)는 BMA 공정에서 사용되거나 생산된 모듈을 자동으로 보관하고 관리하는 BMA 자동 창고를 의미한다.\n\nBP(BSA)는 배터리 시스템이 조립되는 핵심 공정 구역인 BSA 공정을 의미한다.\n\nSL(BSA)은 BSA 공정 내의 특정 라인이나 로드 지점을 나타내는 BSA 공정 관련 명칭이다.\n\nSP(BSA)은 BSA 공정 내의 특정 생산 지점을 나타내는 BSA 공정 관련 명칭이다.\n\nSC(System Complete)는 최종 조립이 완료된 배터리 시스템을 보관하는 완제품 창고를 의미한다.\n\nEQP(Equipment)는 물건을 가공하거나 조립하는 하드웨어 및 PLC 기반의 물리적인 장비 본체를 의미한다.\n\nEQP HMI(Human-Machine Interface)는 작업자가 물리적인 생산 장비를 제어, 모니터링 및 관리할 수 있도록 지원하는 소프트웨어 및 터치 패널 하드웨어 기반의 사용자 인터페이스이다.\n\nAMR(Autonomous Mobile Robot)은 부품을 실어 나르는 자율주행 운반 로봇을 의미한다.\n\nWeb ACS(AMR Control System)는 AMR의 경로 지정, 작업 할당 및 실시간 모니터링을 수행하는 웹 기반의 중앙 통제 시스템이다.\n\nPLT(Pallet)는 물품을 적재하고 운반하는 데 사용되는 운반대인 팔렛트를 의미한다.\n\nOK(Good)는 정상품 또는 장비의 정상적인 상태를 의미한다.\n\nNG(Not Good)는 불량품 또는 장비의 비정상적인 상태를 의미한다.\n도킹 전 트래픽 발생 시 창고(Warehouse) 문제로 인해 AMR이 이동 중 멈추거나 경로가 막힌 경우, 수동 조작이 필요한 상황에서 작업자는 AMR의 Job Cancel을 실행하고 AMR을 주행 경로 밖으로 이동시킨 후, 창고 문제가 해결되면 다시 AMR을 주행 경로 안으로 복귀시켜 상태를 Before Docking으로 변경한다.\n0.3T AMR(Box Conveyor)이 도킹 후 에러를 발생시켰으나 도킹 상태가 정상(Docking OK)인 경우, 작업자는 0.3T AMR HMI 메인 화면에서 RESUME 버튼을 클릭하여 복구를 시도한다.\n\n자동 복구 실패 시, 0.3T AMR의 1차 초기화를 위해 설비의 Work Reset을 수행한 후 AMR의 Job Cancel, Error Reset, Door Close를 순차적으로 진행하고 상태를 After Docking으로 변경한다.\n\n1차 초기화 후에도 문제가 해결되지 않을 경우, 0.3T AMR의 2차 완전 초기화를 위해 설비의 Call Create Pause를 ON으로 설정하고 Call Cancel 및 Work Reset을 수행하며, AMR의 Job Cancel과 Error Reset을 실행한다.\n\n2차 완전 초기화 후 작업 전 단계(Before Work)에서 수동 조작이 필요한 경우, 0.3T AMR의 상태를 After Docking으로 설정하고 공급 미션은 MS25(회수 포트)로, 회수 미션은 복귀(Go back)로 지정한 뒤 설비 라인을 점검하고 Call Create Pause를 OFF로 전환한다.\n\n2차 완전 초기화 후 작업 중 단계(In Work)에서 수동 조작이 필요한 경우, 0.3T AMR의 박스 위치 점검과 도어 닫기를 수행한 후 Payload 값을 수동으로 설정한다.\n\n작업 중 단계에서 0.3T AMR에 적재된 박스가 빈 박스(Empty Box)인 경우, MS25 Unload를 수행하고 Auto 모드로 전환하여 복귀 절차를 진행한다.\n\n작업 중 단계에서 0.3T AMR에 실물 박스가 적재되어 있거나 박스가 없는 경우(Full Box or Nothing), 즉시 창고 복귀(Go Back)를 수행하고 설비의 Call Create Pause를 OFF로 변경하여 라인을 재개한다.\n1T AMR(Pallet Lift)의 도킹 성공 후 제품(SKID)이 있는 상태에서 트러블 슈팅이 해결되지 않을 경우, 설비 PLC 및 센서를 점검하고 1T AMR의 리프트를 작업 전 상태로 상하 구동하여 초기화한 뒤 설비 Work Reset과 AMR의 Job Cancel, Error Reset, After Docking 설정을 순차적으로 수행한다.\n\n1T AMR(Pallet Lift)의 도킹 성공 후 제품(SKID)이 없는 상태에서 설비(Product Line) 측 문제로 에러가 발생한 경우, 설비의 Call Create Pause를 활성화하고 Call Cancel과 Work Reset을 수행한 뒤 AMR의 Job Cancel, Error Reset, After Docking 처리를 거쳐 라인 점검 후 Call Create Pause를 해제한다.\n\n1T AMR(Pallet Lift)의 도킹 성공 후 제품(SKID)이 없는 상태에서 창고(Warehouse) 측 문제로 에러가 발생한 경우, 수동 조작이 필요한 상황으로 간주하여 보전반을 호출한다.\n\n1T AMR(Pallet Lift)의 도킹 상태 확인 결과 도킹에 실패한 경우, [4.1. 도킹 실패 및 센서 에러] 섹션에 명시된 조치 절차를 수행한다.\n\n1T AMR(Pallet Lift)의 도킹 성공 후 제품(SKID)이 감지되었으나 자동 복구에 실패하여 AMR 센서 이상이 확인된 경우, [5.2 센서 점검] 가이드에 따라 조치한다.",
        "textbook": "# BMA/BSA 자동화 시스템 아키텍처 및 제어 로직 기술 백서\n## (Technical Whitepaper: BMA/BSA Automation System Architecture & Control Logic)\n\n**작성자:** 수석 아키텍트 (Chief Architect)  \n**문서 등급:** 대외비 (Confidential)  \n**적용 공정:** 현대자동차그룹 BMA/BSA Manufacturing Line\n\n---\n\n## 1. 서론: 통합 제어 시스템의 계층적 구조 (Hierarchical Control Architecture)\n\nBMA(Battery Module Assembly) 및 BSA(Battery System Assembly) 공정은 단순한 물리적 조립을 넘어, 데이터와 물류가 실시간으로 동기화되는 **CPS(Cyber-Physical System)** 환경입니다. 본 시스템은 최상위 관리 시스템인 **MCS**와 **WMS**, 중간 제어 계층인 **ACS**, 그리고 현장 제어 계층인 **PLC**와 **AMR**이 유기적으로 결합된 다층 구조(Multi-layered Architecture)를 갖습니다.\n\n### 1.1 데이터 흐름과 제어 권한의 위계 (Data Topology)\n시스템의 안정성을 보장하기 위해 제어 권한은 엄격한 위계 구조를 따릅니다.\n\n*   **MCS (Material Control System):** 공정의 '두뇌'에 해당합니다. 생산 계획에 따라 부품 소요량을 예측하고, 하위 시스템에 작업(Job)을 할당합니다. MCS는 직접 장비를 제어하지 않고, **PLC**와의 통신을 통해 트리거(Trigger) 신호를 수신하여 **ACS**에 물류 명령을 하달하는 **이벤트 기반(Event-Driven)** 아키텍처를 채택하고 있습니다.\n*   **ACS (AMR Control System - Web ACS):** 자율주행 로봇(AMR) 군집을 관리하는 '관제탑'입니다. MCS로부터 할당받은 작업을 수행하기 위해 최적의 경로(Path Planning)를 연산하고, 다수의 AMR 간 트래픽을 중재(Arbitration)하며, 실시간 위치 및 상태를 모니터링합니다.\n*   **PLC (Programmable Logic Controller):** 물리적 장비(EQP)를 제어하는 '신경망'입니다. 센서(Sensor)로부터 입력된 아날로그/디지털 신호를 밀리초(ms) 단위의 스캔 타임(Scan Time) 내에 처리하여 모터, 밸브, 리프트 등의 액추에이터를 결정론적(Deterministic)으로 제어합니다.\n*   **WMS (Warehouse Management System):** 재고의 정합성을 보장합니다. MS(Material Storage), MW(Module Warehouse), SC(System Complete) 등 각 창고 구역의 입출고 트랜잭션을 관리하며, 물리적 재고 위치와 전산 재고를 동기화합니다.\n\n---\n\n## 2. 공정 역학 및 물류 흐름 (Process Dynamics & Material Flow)\n\n배터리 제조 공정은 에너지 밀도가 높은 셀(Cell)을 다루므로, 물리적 충격 방지와 정밀한 위치 제어가 필수적입니다. 물류 흐름은 에너지 단위의 결합 과정에 따라 다음과 같이 구성됩니다.\n\n1.  **Cell to Module (BMA 공정):**\n    *   **CS (BMA CELL):** 가장 기본 단위인 배터리 셀이 투입되는 시점입니다.\n    *   **MC (BMA):** 셀들이 결합되어 모듈(Module) 형태를 갖추는 핵심 조립 구역입니다.\n    *   **MW (Module Warehouse):** 완성된 모듈이 BSA 공정으로 넘어가기 전, 버퍼(Buffer) 역할을 수행하는 자동 창고입니다.\n2.  **Module to System (BSA 공정):**\n    *   **BP (BSA):** 모듈들이 **L/C (Lower Case)** 위에 안착되어 최종 시스템으로 조립됩니다.\n    *   **LWR CASE (LL):** 배터리 팩의 하부 하우징으로, 구조적 강성을 담당합니다.\n    *   **SC (System Complete):** 조립이 완료된 배터리 시스템이 보관되는 최종 단계입니다.\n3.  **Support Logistics:**\n    *   **MS (Material Storage):** 부품 공급의 원천입니다.\n    *   **SKID RETURN (RC):** 물류 순환의 핵심인 스키드(Skid)를 회수하여 재투입하는 루프(Loop) 시스템입니다.\n\n---\n\n## 3. 자율주행 로봇(AMR)의 메커니즘 및 운영 로직\n\nAMR은 단순한 운송 수단이 아니라, 공정 간의 '동기화'를 담당하는 능동적 에이전트입니다. 적재물의 특성에 따라 두 가지 타입으로 운용됩니다.\n\n### 3.1 0.3T AMR (Box Conveyor Type)\n*   **작동 원리:** 상단에 컨베이어 벨트가 장착되어 있어, 설비(EQP)의 컨베이어와 도킹(Docking) 시 속도와 위치를 동기화하여 박스(Box) 단위의 자재를 이송합니다.\n*   **핵심 기술:** 설비와의 정밀한 정렬(Alignment)이 요구되며, 이송 시 진동을 최소화하여 셀(Cell) 손상을 방지합니다.\n\n### 3.2 1T AMR (Pallet Lift Type)\n*   **작동 원리:** 고중량의 팔렛트(PLT)나 스키드(SKID)를 들어 올리는 리프트(Lift) 메커니즘을 탑재하고 있습니다.\n*   **핵심 기술:** 무게 중심(Center of Gravity) 변화에 따른 주행 안정성 확보와, 리프트 상하 구동 시의 유압/전동 제어 정밀도가 핵심입니다.\n\n---\n\n## 4. 결함 허용 시스템 및 예외 처리 전략 (Fault Tolerance & Exception Handling)\n\n자동화 시스템에서 에러는 피할 수 없는 변수입니다. 따라서 시스템은 에러 발생 시 **교착 상태(Deadlock)**를 방지하고, 최단 시간 내에 정상 상태로 복귀(Recovery)하기 위한 다단계 로직을 내장하고 있습니다.\n\n### 4.1 트래픽 제어 및 교착 상태 해결 (Traffic & Deadlock Resolution)\n다수의 AMR이 좁은 경로에서 운용될 때, 창고(Warehouse) 측의 지연이나 병목 현상으로 인해 AMR이 주행 경로 상에서 고립되는 경우가 발생합니다.\n\n*   **논리적 인과관계:** [창고 문제 발생] -> [AMR 경로 점유 및 정지] -> [후속 AMR 진입 불가 (Traffic Jam)]\n*   **해결 메커니즘:**\n    1.  **Job Cancel (자원 점유 해제):** 작업자는 ACS 상에서 해당 AMR의 작업을 취소하여, 시스템이 해당 로봇에 할당한 논리적 점유권(Token)을 해제합니다.\n    2.  **Physical Relocation (물리적 회피):** AMR을 주행 경로 밖으로 수동 이동시켜 물리적 병목을 해소합니다.\n    3.  **State Restoration (상태 복원):** 창고 문제가 해결되면, AMR을 다시 경로로 복귀시키고 상태를 **'Before Docking'**으로 재설정합니다. 이는 AMR의 상태 머신(State Machine)을 초기 진입 단계로 리셋하여, 중단된 시점부터 논리적 오류 없이 프로세스를 재개하기 위함입니다.\n\n### 4.2 0.3T AMR 도킹 에러 복구 프로토콜 (3-Stage Recovery Logic)\n도킹(Docking)은 AMR과 설비 간의 물리적/통신적 결합이 일어나는 가장 불안정한 단계입니다. 시스템은 에러의 심각도에 따라 3단계의 복구 절차를 수행합니다.\n\n#### 1단계: 일시적 통신/센서 오류 (Transient Error)\n*   **현상:** 도킹 상태는 물리적으로 정상(Docking OK)이나, 소프트웨어적 에러가 발생한 경우.\n*   **조치:** **RESUME** 명령을 통해 일시적인 패킷 손실이나 타임아웃을 무시하고 프로세스를 재개합니다.\n\n#### 2단계: 로직 불일치 (Logic Mismatch) - 1차 초기화\n*   **현상:** RESUME 실패 시. 설비와 AMR 간의 시퀀스 스텝이 어긋난 상태입니다.\n*   **조치:**\n    1.  **EQP Work Reset:** 설비 측의 PLC 시퀀스를 초기화합니다.\n    2.  **AMR Reset Sequence:** Job Cancel -> Error Reset -> Door Close.\n    3.  **State Sync:** AMR 상태를 **'After Docking'**으로 강제 설정하여, 설비가 작업을 완료했다고 인식하게 함으로써 다음 프로세스로 넘어가도록 유도합니다.\n\n#### 3단계: 시스템 비동기화 (System Desynchronization) - 2차 완전 초기화\n*   **현상:** 1차 초기화 실패 시. 상위 시스템(MCS)과 현장 설비 간의 데이터 정합성이 깨진 상태입니다.\n*   **조치 (심층 분석):**\n    1.  **Call Create Pause (ON):** **가장 중요한 단계**입니다. 복구 작업 중 MCS가 새로운 자재 보충 요청(Call)을 생성하지 못하도록 막아, '복구 중 추가 명령 유입'으로 인한 논리적 충돌(Race Condition)을 방지합니다.\n    2.  **Call Cancel & Work Reset:** 기존에 발행된 잘못된 요청을 삭제하고 설비를 리셋합니다.\n    3.  **Conditional Recovery (조건부 복구):**\n        *   **작업 전(Before Work):** 공급 미션은 회수 포트(MS25)로, 회수 미션은 복귀(Go Back)로 변경하여 안전하게 라인을 비웁니다.\n        *   **작업 중(In Work):** 박스 유무를 센서로 재확인합니다.\n            *   **Empty Box:** MS25에서 언로딩(Unload) 후 복귀. (빈 박스 회수 로직)\n            *   **Full Box / Nothing:** 즉시 복귀(Go Back). (실물 자재가 있거나 아예 없는 경우, 공정 투입 부적합으로 판단하여 창고로 회송)\n    4.  **Call Create Pause (OFF):** 모든 조치가 완료되면 Pause를 해제하여 정상적인 생산 요청을 다시 수신합니다.\n\n### 4.3 1T AMR (Pallet Lift) 예외 처리 로직\n1T AMR은 고중량물을 다루므로, **제품(SKID)의 유무**와 **에러의 원천(설비 vs 창고)**에 따라 대응 로직이 분기됩니다.\n\n1.  **SKID 존재 시 (Load State):**\n    *   **위험 요소:** 리프트가 상승한 상태에서 에러 발생 시 전복 위험이 있습니다.\n    *   **조치:** 리프트를 하강(초기화)하여 무게 중심을 낮춘 후, 설비와 AMR을 리셋하고 **'After Docking'** 상태로 전환하여 잔여 프로세스를 수행합니다.\n2.  **SKID 부재 시 (Unload State):**\n    *   **설비(Product Line) 문제:** 설비 센서 오작동 등으로 인한 경우, **Call Create Pause**를 걸고 설비 로직을 리셋하여 허위 호출을 제거합니다.\n    *   **창고(Warehouse) 문제:** WMS 상의 재고 데이터와 실제 물리적 상태가 불일치하는 경우입니다. 이는 자동 복구가 불가능한 치명적 오류(Critical Error)로 간주하여, 즉시 보전반(Maintenance Team)을 호출해 수동으로 데이터를 보정해야 합니다.\n\n### 4.4 센서 퓨전 및 하드웨어 점검 (Sensor Fusion & H/W Check)\n도킹 실패나 자동 복구 불가 시, 이는 단순 소프트웨어 문제가 아니라 물리적 센서(Lidar, IR, Camera 등)의 오염이나 고장일 가능성이 높습니다.\n*   **V-Marker 인식 실패:** AMR은 설비에 부착된 반사판(V-Marker)을 Lidar로 스캔하여 정밀 위치를 보정합니다. 도킹 실패 시 이 마커의 손상 여부나 센서 렌즈의 오염을 우선적으로 점검해야 합니다 ([4.1 도킹 실패] 및 [5.2 센서 점검] 참조).\n\n---\n\n## 5. 결론 (Conclusion)\n\n본 BMA/BSA 자동화 시스템은 MCS-ACS-PLC로 이어지는 견고한 데이터 파이프라인과, 0.3T/1T AMR의 특화된 기구학적 설계를 바탕으로 구축되었습니다. 특히, 다단계 에러 복구 시나리오(Resume -> Reset -> Full Initialization)와 **Call Create Pause**와 같은 트래픽 제어 기법은 시스템의 가동률(Availability)을 극대화하고 다운타임을 최소화하는 핵심 기술입니다. 엔지니어는 단순한 매뉴얼 준수를 넘어, 이러한 시스템의 논리적 인과관계를 이해하고 상황에 맞는 최적의 트러블 슈팅을 수행해야 합니다."
    }
]
